{
    "code": 200,
    "status": "success",
    "Message": "Successful",
    "recipe_data": [
        {
            "Title": "Kadai Mushroom Recipe (3 Ways)",
            "Ingredients": "1, tablespoon, coriander seeds, 3 to 4, dry red chilies, – broken and deseeded if preferred, ½, teaspoon, cumin seeds, ½, inch, cinnamon, 1, green cardamom, 2, cloves, 3 to 4, whole black pepper, 1, single strand of mace, – optional, 200 to 250, grams, button mushrooms, – sliced, ½, cup, thinly sliced capsicum, – or 1 medium-sized capsicum (red or green or yellow bell pepper), 1, cup, chopped tomatoes, – pureed or about ¾ cup tomato puree or 2 medium-sized tomatoes (use tomatoes which are ripe, red and not too tangy), ½, cup, finely chopped onions, or 1 medium-sized onion, 1, teaspoon, or 1 inch ginger + 3 to 4 small to medium-sized garlic, crushed in a mortar-pestle, 1, teaspoon, crushed kasuri methi, (dry fenugreek leaves), ¼, teaspoon, turmeric powder, – optional, ½, cup, water, or 125 ml water, 3, tablespoons, oil, – sunflower oil or any neutral vegetable oil, salt, as required, 1 to 2, tablespoon, chopped coriander leaves, (cilantro), 1, inch, ginger, – julienne, 1 or 2, tablespoons, cream, – low fat 25 to 35 % cream can be added right at the end and mixed with the gravy, ¼, teaspoon, or punjabi garam masala- garam masala powder can be added when you add the kasuri methi (dry fenugreek leaves), 1, tablespoon, coriander seeds, ½, teaspoon, cumin seeds, 1, inch, cinnamon, – use true cinnamon and not cassia cinnamon, 2, cloves, 2, green cardamoms, 3 to 4, dry kashmiri red chilies, or 2 to 3 dry red chilies – broken and seeds removed, 3, tablespoons, oil, – sunflower oil or any neutral-flavored oil, ⅓, cup, chopped onions, or 1 medium-sized onion or 50 grams onion, ½, teaspoon, garlic paste, or 4 to 5 medium garlic cloves crushed in mortar pestle, 1, teaspoon, finely chopped ginger, or 1-inch ginger, 1, green chilli, or serrano pepper – slit, 1, cup, finely chopped tomatoes, or 2 medium to large tomatoes or 150 grams tomatoes, 200 to 250, grams, white button mushrooms, – sliced or chopped, ¼, teaspoon, turmeric powder, (ground turmeric), salt, as required, ½, cup, water, ½, cup, thinly sliced capsicum, or 1 small to medium capsicum (green bell pepper), ½ to 1, teaspoon, crushed kasuri methi, (dry fenugreek leaves) – optional, 1 to 2, tablespoons, chopped coriander leaves, (cilantro), ½, inch, ginger, – julienne, for garnish",
            "Instructions": [
                "First dry roast all the spices mentioned above for the kadai masala, on a low flame in a kadai or wok or a pan till fragrant. Don't burn them.",
                "Heat oil in a kadai or pan. Add the sliced mushrooms.",
                "Stir & sauté the sliced mushrooms. First you will see the mushrooms releasing a lot of water.",
                "Then add the sliced capsicum (bell pepper). Stir and saute for 5 to 6 minutes on a low flame",
                "Then add ½ cup water. Season with salt.",
                "Stir & bring the gravy to a simmer on a low flame till you see a few specks of oil on top.",
                "Add the sautéed mushrooms and mix very well. You can add some more water if the gravy looks very dry.",
                "Lastly add crushed kasuri methi (dry fenugreek leaves) and mix well. Switch off the heat.",
                "Serve kadai mushroom dry hot with roti, paratha or naan. While serving you can garnish with ginger julienne and chopped coriander leaves.",
                "Switch on the instant pot. Press the sauté button for 15 to 20 minutes on the normal mode. Add oil in the steel insert of the instant pot.",
                "When the oil becomes hot, add the chopped onions. Saute stirring often, till the onions soften and become translucent.",
                "Then add ½ teaspoon garlic paste, 1 teaspoon finely chopped ginger, 1 slit green chilli or serrano pepper.",
                "Mix and sauté for 3 to 4 seconds.",
                "Add 1 cup finely chopped tomatoes and sauté till the tomatoes soften and become pulpy.",
                "Add sliced button mushrooms.",
                "Mix very well and deglaze the pot. Scrap any stuck bits of ingredients from the bottom of the pot. The moisture from the mushrooms help in deglazing.",
                "Sauté for about 3 minutes.",
                "Add turmeric powder and salt as required. Mix again well.",
                "Add ½ cup water. Deglaze if required.",
                "Press cancel and press the pressure cook or manual button. Set the timer to pressure cook for 3 minutes on high pressure.",
                "Then do a quick pressure release by lifting the valve. Open the lid.",
                "Then add capsicum and ground kadai masala and 1 teaspoon kasuri methi (crushed). Mix very well. You can reserve ½ teaspoon of kadai masala for garnish. Kasuri methi is dried fenugreek leaves. If you do not have kasuri methi then skip it.",
                "Press the sauté button for 5 to 6 minutes on the normal mode.",
                "Sauté for 5 to 6 minutes. Stir often. You can reduce to the low setting if the masala sticks to the pan or heat becomes too much.",
                "Sauté till the capsicum is half cooked. The capsicum should have some crunch in them.",
                "Add 1 to 2 tablespoon chopped coriander leaves. Mix well.",
                "Serve instant pot kadai mushroom garnished with some coriander leaves and ginger julienne (optional). Serve with chapati, tandoori roti, naan or dinner rolls or bread. Also sprinkle the kadai masala, if you have reserved it while serving the dish."
            ],
            "Description": "Kadai Mushroom is such a super easy and delicious dish of sautéed button mushrooms, onions, bell peppers (capsicum) in a spiced, tangy tomato sauce. The recipe comes together in 30 minutes and so delish with naan, roti and even bread rolls.",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Pulao",
            "Ingredients": "3, tablespoons, oil, 1.5, cups, basmati rice, – you can use any type of long grained rice, 200 to 250, grams, white button mushrooms,, sliced or chopped, 85, grams, onion, or 1 medium size onion, thinly sliced or finely chopped, about ⅓ to ½ cup sliced or chopped onions, 1, tomato, – medium-sized or ⅓ cup chopped tomatoes, 1, potato, – medium-sized, peeled & cubed, optional, 1 to 2, green chilies, – chopped, ½, tablespoon, or 1 inch ginger + 6 to 7 garlic, crushed in mortar-pestle, 1, cup, 1.5 to 1.75, cups, water, or add a total of of 2.5 to 2.75 cups water minus the coconut milk. Check point 1 below in the notes., salt, or sea salt as required, 1, tej patta, (Indian bay leaf), 1 to 1.5, inches, cinnamon, 3, green cardamoms, 4 to 5, cloves, 6 to 7, black peppercorns, 1, teaspoon, cumin seeds, , optional",
            "Instructions": [
                "Clean, wash and soak the rice for 20 to 30 minutes.",
                "When the rice is getting soaked, chop all the veggies. Rinse and chop the mushrooms too.",
                "After 20 to 30 minutes drain all the water from the rice. Set the soaked rice aside.",
                "Add the onions and fry them stirring often till they become light golden.",
                "Add the ginger-garlic paste and saute for a few seconds or till the raw smell of the paste disappears.",
                "Now add the chopped tomatoes, potatoes and mushrooms. Saute for 4 to 5 minutes till the mushrooms are half cooked on low to medium heat. Keep on stirring in between.",
                "Saute the rice for 1 to 2 minutes stirring in between on a low heat.",
                "Add the coconut milk and water. Stir and season with salt as per taste. Mix very well.",
                "Check the taste of the broth and it should taste slightly salty.",
                "Pressure cook the mushroom pulao for 2 to 3 whistles or for 9 to 10 minutes. If using 3-liter cooker, pressure cook for 2 whistles and for a 2 litre cooker, pressure cook for 3 whistles.",
                "When the pressure settles down on its own, then only remove the lid and gently fluff the rice with a fork.",
                "Garnish with coriander leaves or mint leaves and serve mushroom pulao with sliced onions and lime. You could also have it with onion-tomato raita or any raita of your choice."
            ],
            "Description": "Mushroom pulao is a quick, easy and tasty pulao variant made with white button mushrooms, basmati rice, coconut milk, aromatics and herbs. While I share the recipe in a stovetop pressure cooker, you can easily make it in a pan or in the Instant Pot. The recipe comes together in about 45 minutes and makes for a comforting, healthy lunch or dinner.",
            "Prep Time": "25 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "Goan",
            "Course": "Main Course"
        },
        {
            "Title": "Dhingri Dolma – Awadhi Style Dhingri (Mushroom)",
            "Ingredients": "250, grams, crumbled or grated, 200 to 250, grams, button mushrooms, sliced or chopped, 1, medium onion, chopped or ⅓ cup chopped onion, 1, large tomato, cut in 1 cm cubes or ¾ cup tomato cubes, 1, teaspoon, or 1 inch ginger ginger + 3 to 4 garlic cloves, crushed in mortar-pestle, ½, teaspoon, caraway seeds, ¼, teaspoon, red chili powder, ½, teaspoon, black pepper powder, or white pepper powder, 2, tablespoons, or ghee or oil, 2, tablespoons, chopped coriander leaves, ¼, teaspoon, 1, inch, ginger, julienne, salt, as required",
            "Instructions": [
                "Rinse or wipe dry the button mushrooms. Slice or chop the mushrooms.",
                "Also chop the onions and cut the tomatoes in cubes.",
                "Crush the ginger and garlic to a paste in a mortar-pestle.",
                "Add the caraway seeds (shahi jeera) and sauté till they splutter.",
                "Then add onions and saute them stirring often till they turn light brown on medium-low to medium heat.",
                "Next add the ginger-garlic paste and sauté for a few seconds or till the raw aroma of the ginger garlic paste goes away.",
                "Then add the spice powders – red chili powder and black pepper or white pepper powder.",
                "Stir very well and saute till the tomatoes soften on medium-low heat.",
                "The mushrooms would first begin to release water. Sauté on a medium-low to medium heat stirring occasionally, till the all the water dries up.",
                "A light browning of the mushrooms along the edges is alright.",
                "Sprinkle garam masala powder and salt as required.",
                "Stir and mix the paneer with the rest of the ingredients. On a low heat cook for 30 seconds to 1 minute and then switch off the heat.",
                "Lastly add the chopped coriander leaves and ginger julienne. Mix well.",
                "Serve dhingri dolma hot or warm with roti, naan or chapati. You can also serve them with whole wheat bread."
            ],
            "Description": "Dhingri dolma is a delicious, mildly spiced, semi-dry curry recipe from the Awadhi cuisine featuring earthy button mushrooms and soft paneer (Indian cottage cheese) in a savory base of onions, tomatoes, herbs and a special spice – caraway seeds (",
            "Prep Time": "15 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Awadhi, North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Fry (Goan Style)",
            "Ingredients": "250, grams, button mushrooms, ¾ to 1, cup, thinly sliced onions, or 1 large onion or 2 medium-sized onions, 2 to 3, green chilies, ½, teaspoon, cumin powder, (ground cumin), ¼, teaspoon, turmeric powder, (ground turmeric), ¼, teaspoon, black pepper powder, (ground black pepper), 1, pinch, red chili powder, or cayenne pepper – optional, 1 to 2, pinches, 2, tablespoons, oil, 1 or 2, tablespoons, chopped coriander leaves, (cilantro), salt, as required",
            "Instructions": [
                "Rinse mushrooms in water a few times using a colander or strainer. Trim the bottom part of the stalks and chop the mushrooms. Discard these.",
                "Slice the onions thinly, slit the green chilies.",
                "Heat oil in a pan or kadai (wok).",
                "Add the onions and sauté stirring often till they begin to get light golden.",
                "This process of cooking onions takes a lot of time. So, to quicken it, add a pinch of salt to the onions. This helps the onions to cook faster.",
                "The onions should have softness in them. So, when you see them beginning to get light golden, proceed to the next step. Don't make the onions crisp or browned.",
                "Add the green chilies and sauté for half a minute.",
                "Now, add the chopped mushrooms and stir.",
                "Add all the ground spice powders including salt as required.",
                "Sauté the mushrooms till they shrink in size and leave water.",
                "Sauté till the mushrooms turn light golden. The mixture should be dry.",
                "Add coriander leaves. Stir and cook for a minute.",
                "Switch off the heat and serve Mushroom Fry hot or warm with roti, bread or dinner rolls."
            ],
            "Description": "This Goan style Mushroom Fry recipe is the simplest way to use mushrooms and turn them into a quick, delicious dish. Fresh succulent button mushrooms are sautéed with onions, green chilies and some spices in this Mushroom Fry. The dish is as easy to make as it sounds. Give this a try, because I know you’re going to love it.",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Goan, Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Peas Curry (Batani Curry)",
            "Ingredients": "1, tablespoon, oil, – for sautéing mushrooms, 200 to 250, grams, button mushrooms, 1, cup, green peas, – fresh or frozen, water, as required, ½, cup, fresh grated coconut, 7 to 8, cashews, ¼ or ⅓, cup, water, or as required for blending or grinding, 2, tablespoons, oil, – for the curry, ½, teaspoon, mustard seeds, (rai), 1, teaspoon, urad dal, (split and hulled black gram), ¼, teaspoon, fenugreek seeds, (methi dana), 1, teaspoon, cumin seeds, ⅓, cup, chopped onions, 1 medium-sized onion, 1, teaspoon, or 1 inch ginger and 3 small to medium garlic cloves, crushed into a paste in mortar-pestle, ½, cup, chopped tomatoes, or 1 medium-sized tomato, ½, teaspoon, red chilli powder, ½, teaspoon, turmeric powder, (ground turmeric), 1, teaspoon, (ground coriander), ½, teaspoon, 10 to 12, curry leaves, or 1 sprig of curry leaves, 2 to 2.5, cup, green peas stock, or water or both, salt, as required, 1 to 2, tablespoons, chopped coriander leaves, – for garnish",
            "Instructions": [
                "Boil the green peas in enough water. Strain and keep aside. Reserve the stock if using fresh peas.",
                "Grind or blend the coconut and cashews with water to a fine smooth paste. Set aside.",
                "Heat 1 tablespoon oil in a frying pan or skillet. Sauté chopped mushrooms in the oil for 5 to 6 minutes on medium to medium-high heat and then set aside.",
                "In another pan, add 2 tablespoons oil. Add the mustard seeds and let them crackle.",
                "Then add the cumin seeds, fenugreek seeds and urad dal.",
                "Fry till the oil becomes aromatic and the dal gets golden. Don't over brown or burn the dal. Do this on a low or medium-low heat.",
                "Now, add chopped onions. Sauté the onions stirring often till light golden.",
                "Fry till the raw aroma of the ginger-garlic goes away.",
                "Now, add all the spice powders – coriander powder, red chili powder, turmeric powder and garam masala powder. Mix to combine.",
                "Add chopped tomatoes. Sauté the mixture stirring often till the oil starts to leave its sides",
                "Add the cashewnut-coconut paste and the curry leaves.",
                "Mix and stir for 2 to 3 minutes. Add about 2 to 2.5 cups of the reserved green peas stock or water. You can add water less or more depending on the consistency you prefer.",
                "Let the curry come to a boil and thicken slightly. Now, add the sautéed mushrooms and cooked green peas.",
                "Add salt, stir and let the batani curry simmer further for 3 to 4 minutes more.",
                "Serve the curry hot, garnished with some chopped coriander leaves."
            ],
            "Description": "Various",
            "Prep Time": "20 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "South Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Pasta",
            "Ingredients": "1, cup, shell pasta, or macaroni, 200 to 250, grams, white button mushrooms, 1, yellow bell pepper, or red bell pepper (medium to large-sized) – optional, 1, small onion, – finely chopped, 2, garlic cloves, (small to medium-sized) – finely chopped, 1, teaspoon, chopped parsley, or coriander leaves (cilantro), 1, teaspoon, chopped basil, 2, tablespoon, all-purpose flour, 1.5, cups, whole milk, 2, tablespoons, (salted or unsalted), 2 to 3, tablespoon, grated cheddar cheese, or mozzarella cheese, salt, as required, black pepper, as required",
            "Instructions": [
                "Heat enough water with salt until it begins to boil.",
                "Add the pasta and cook the pasta until they are al dente.",
                "When done, strain them in a colander or strainer.",
                "Drain and set them aside.",
                "Rinse the mushrooms well in water in a strainer or colander. Drain them.",
                "Trim the stalks and slice them. Set aside. Chop the bell pepper and set aside.",
                "Melt butter in a pan. Add the garlic and saute for about 10 to 12 seconds on a low flame.",
                "The mushrooms will release their juices initially and after continuous sauteing, the juices will evaporate.",
                "Keep on stirring at intervals while sautéing mushrooms.",
                "After the liquids have evaporated and the mushrooms have cooked, add the chopped bell pepper and sauté for 4 to 5 mins on a low flame.",
                "Add the flour.",
                "Stir well and sauté for 3 to 4 mins on a low flame.",
                "Stir well and simmer for 1 to 2 minutes more.",
                "Pour the pasta in a baking pan or bowl.",
                "Top with grated cheese and bake in a pre heated oven at 180 degrees Celsius (356 degrees Fahrenheit) until the cheese melts.",
                "Serve the pasta with a vegetable soup and with some warm toasted brown bread or white bread."
            ],
            "Description": "This Mushroom Pasta is a delicious dish of sautéed mushrooms mixed with shell pasta in a creamy sauce. The white cream sauce is conveniently made in the same pan as the sautéed mushrooms, garlic and onions, absorbing all of the great flavors as it thickens. An easy recipe to make, this vegetarian meal is full of flavor and has a fantastic creamy consistency.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "World",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Manchurian",
            "Ingredients": "½, cup, all-purpose flour, 3, tablespoons, cornflour, (cornstarch), 1, teaspoon, ½, teaspoon, black pepper powder, or freshly crushed black pepper, 1, teaspoon, soy sauce, ⅓, cup, water, or add as required, ½, teaspoon, sugar, or add as required, salt, as required, 250, grams, white button mushrooms, oil, as required for deep frying or shallow frying, 1 to 2, tablespoons, oil, ⅓, cup, spring onions, (finely chopped spring onion whites) or 3 to 4 small-sized scallions – reserve the greens for garnish, 2 to 3, green chilies, – finely chopped, 2, teaspoons, garlic, – finely chopped, 2, teaspoons, ginger, – finely chopped, 1, teaspoon, celery, – finely chopped, optional, ½, teaspoon, black pepper powder, or crushed black pepper, 1, tablespoon, soy sauce, or add as needed, 1, bell pepper, (small to medium-sized), green or red or yellow sliced, diced or chopped, salt, as required",
            "Instructions": [
                "Take all the ingredients for making the batter in a mixing bowl.",
                "Add ⅓ cup water and make a smooth batter. Not too thick nor too thin.",
                "Rinse the mushrooms in water a few times. Drain all of the water.  Halve the mushrooms or quarter them if they are large. Trim off a small portion of the stalks and discard them.",
                "Heat oil for deep frying or shallo frying as needed in a wok or kadai.",
                "Let the oil become medium hot. Dip the mushroom in the batter evenly all over. Place them carefully and gently in the oil.",
                "Fry them till golden brown and crisp. When one side looks firm and light golden, turn over each mushroom piece and fry the second side. Turning over as needed fry the mushrooms until crispy and golden.",
                "Keep the fried mushrooms aside.",
                "Heat 1 to 2 tablespoons oil in a frying pan or wok. Add the spring onion whites and stir fry them for a minute on a medium heat.",
                "Stir fry these also for a minute on a medium heat.",
                "Add the black pepper, salt, sugar and soy sauce.",
                "Serve dry Mushroom Manchurian hot garnished with chopped spring onion greens and celery."
            ],
            "Description": "This spicy, tangy Indo-Chinese recipe for Mushroom Manchurian is sure to please both vegetarians and vegans alike. Meaty mushrooms are battered and shallow-fried to crispy perfection before being tossed with sweet bell peppers and a delightfully zingy sauce.",
            "Prep Time": "30 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "Indo Chinese",
            "Course": "Appetizers, Side Dish"
        },
        {
            "Title": "Mushroom Masala | Mushroom Curry (Punjabi Style)",
            "Ingredients": "¾ to 1, cup, chopped onions, – 100 grams or 2 medium onions, 1, teaspoon, chopped ginger, or 1 inch ginger, 1, teaspoon, chopped garlic, or 4 to 5 medium-sized garlic, ½, cup, chopped tomatoes, (tightly packed) – 70 grams or 2 small to medium tomatoes or ⅓ cup tomato puree, 200 to 250, grams, white button mushrooms, 4, tablespoon, (yogurt) – whisked till smooth, 3, tablespoons, oil, – any neutral oil, ½, teaspoon, cumin seeds, 2, small tejpatta, or 1 medium to large tejpatta (Indian bay leaf), ½, inch, cinnamon, 1, black cardamom, – optional, 2, green cardamoms, 3, cloves, 1, single strand of mace, – optional, ¼, teaspoon, turmeric powder, (ground turmeric), ½, teaspoon, red chilli powder, 1, teaspoon, (ground coriander), ¾, cup, water, and ⅓ cup water for Instant Pot – add as needed, salt, as required, ¼, teaspoon, ½, teaspoon, dried fenugreek leaves, (kasuri methi) – crushed, 2, tablespoon, chopped coriander leaves, (cilantro)",
            "Instructions": [
                "Rinse or wipe dry the mushrooms. Slice off a part of the base stalk. Then slice or chop them. Set aside.",
                "In a grinder or blender, take the chopped onions, ginger and garlic. Grind to a smooth paste without adding any water.",
                "Remove this paste with a spoon or spatula in a bowl and set aside.",
                "In the same jar, add the chopped tomatoes and make a smooth puree. No need to blanch tomatoes before pureeing. Set the tomato puree aside.",
                "In a small bowl, whisk curd (yogurt) until smooth and set aside.",
                "Heat oil in a pan and add the following whole spices – cumin seeds, tejpatta, cinnamon, black cardamom, green cardamoms, cloves and a single strand of mace.",
                "Fry the spices for a few seconds until they become aromatic and splutter.",
                "Lower the heat and add the ground onion-ginger-garlic paste.",
                "Mix the paste with the oil. If the paste splutters then cover the pan with a lid allowing for some space for the steam to pass.",
                "On a low to medium heat stirring often continue to sauté until the onion paste starts thickening.",
                "Stir and sauté until the paste becomes golden. This sautéing of onion paste takes some time. So to quicken the process add a pinch of salt.",
                "Now add the tomato puree. Stir. Then add the spice powders – turmeric powder, red chilli powder and coriander powder.",
                "Mix well and sauté until you see oil releasing from the sides of the masala.",
                "Add the beaten curd (yogurt). As soon as you add yogurt, mix thoroughly and quickly.",
                "Simmer on a low to medium flame for 2 to 3 minutes.",
                "Then add water.",
                "Season with salt. Mix very well.",
                "Cover the pan with a lid. On a low to medium heat simmer the mushroom masala for 18 to 20 minutes or until the mushrooms are tender.",
                "Lastly add dried fenugreek leaves (crushed), garam masala powder and chopped coriander leaves. Mix again. At this step you can add 1 to 2 tablespoons of heavy cream for a rich tasting curry.",
                "Serve mushroom masala hot or warm.",
                "Use the sauté function of your IP at normal mode. Add the oil in the steel insert and let it get hot.",
                "Add the whole spices and let them splutter.Add onion paste and sauté stirring non-stop until the onion paste turns golden.",
                "Add the tomato puree, ground spices and combine well. Sauté until the masala paste becomes glossy, thickens and you see oil releasing from the sides.",
                "Add in the chopped mushrooms and sauté for 2 to 3 minutes. Press the cancel button.",
                "Add the curd (yogurt). Mix thoroughly and quickly.",
                "Add ⅓ cup water and salt. Mix and deglaze.",
                "Pressure cook on high for 3 minutes.",
                "Then do a quick pressure release after 3 minutes.",
                "Sprinkle dried fenugreek leaves, garam masala powder and coriander leaves. Mix and serve hot.",
                "While serving you can garnish mushroom curry with some coriander leaves.",
                "Serve Mushroom masala with steamed rice, jeera rice or pulao. This mushroom curry also goes very well as a side gravy dish with biryani. You can also have mushroom masala with roti, paratha, naan, bread or dinner rolls.",
                "The leftovers can be refrigerated for 1 to 2 days. Warm the mushroom masala gravy in a pan before serving. If the gravy has thickened too much, then add a few tablespoons of water to thin the consistency."
            ],
            "Description": "This Mushroom Masala recipe is an easy, delicious Punjabi style one-pot mushroom",
            "Prep Time": "20 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Main Course, Side Dish"
        },
        {
            "Title": "Spicy Mushroom Biryani and Chettinad Mushroom Biryani (2 Ways)",
            "Ingredients": "3, tablespoons, oil, – any neutral oil, ½, cup, finely chopped onions, or 1 medium-sized onion, ½, cup, finely chopped tomatoes, (tightly packed) or 1 medium tomato, 1, teaspoon, finely chopped green chillies, or serrano or 1 to 2 green chillies, 2, teaspoons, – 5 to 6 garlic & 1 inch ginger crushed in a mortar, ¼, cup, coriander leaves, – cilantro (tightly packed), ¼, cup, chopped mint leaves, (tightly packed), 8 to 10, curry leaves, – medium-sized, 200, grams, white button mushrooms, – chopped or sliced, ½, teaspoon, turmeric powder, (ground turmeric), ½, teaspoon, red chili powder, or cayenne pepper, ½, teaspoon, 1.5, teaspoon, (ground coriander), ¼, teaspoon, black pepper powder, 1, cup, basmati rice, (heaped) – 200 grams, 2, cups, water, – add more if required, salt, as required, ½, teaspoon, cumin seeds, ½, teaspoon, fennel seeds, 1, inch, cinnamon, 2 to 3, cloves, 2 to 3, green cardamoms, 2 to 3, strands of mace, – thin strands , optional, 1, tej patta, – small to medium (Indian bay leaf), 1, star anise, – small piece , optional, 1, cup, basmati rice, (heaped) – 200 grams or rice, 1, teaspoon, – for marinating rice, ¼, cup, chopped mint leaves, ¼, cup, chopped coriander leaves, (cilantro), 3 to 4, green chilies, 3 to 4, garlic cloves, – small to medium-sized, 1, inch, ginger, ½ to 1, tablespoon, water, 200 to 250, grams, white button mushrooms, – quartered or sliced, 3, tablespoons, (yogurt), ¼ to ⅓, teaspoon, turmeric powder, (ground turmeric), ½, teaspoon, red chilli powder, or cayenne pepper, ½, teaspoon, 1, teaspoon, (ground coriander), 2 to 2.5, tablespoons, oil, – any neutral tasting oil or coconut oil, 1, inch, cinnamon, 2, green cardamoms, 3 to 4, cloves, 6 to 7, black pepper, 1, tejpatta, – medium to large-sized (Indian bay leaf), 2, mace strands, – thin single strands, 1, stone flower, – tiny piece, – optional, 2, kapok buds, – optional, 1, teaspoon, fennel seeds, ¾ to 1, cup, thinly sliced onions, – 100 grams or 2 medium-sized, ½, cup, chopped tomatoes, 80 grams or 1 medium to large, ½ to 1, cup, water, or add as required, 1, cup, – thick, can use lite coconut milk in a pinch, salt, as required, 2 to 3, tablespoons, chopped coriander leaves, or 1 to 2 tablespoons mint leaves",
            "Instructions": [
                "Rinse rice grains a few time until the water is clear of starch. Soak rice in enough water for 20 to 30 mins.",
                "Later drain all the water from the rice and set aside. When the rice is soaking, prep up the rest of the ingredients like chopping veggies, herbs and getting the spices ready.",
                "Heat oil in a deep pan or pot. Make sure that the bottom of the pan is thick, otherwise the rice can get browned or burned.",
                "When the oil becomes hot, add all the whole spices – fennel, cumin, cloves, tej patta, cinnamon, green cardamoms, star anise and mace.",
                "Fry the spices till fragrant for a few seconds.",
                "Then add chopped onions and saute till translucent. Next add ginger-garlic paste, green chilies, half a portion each of the mint and coriander leaves, tomatoes & curry leaves.",
                "Mix very well. Sauté this mixture on a low to medium-low heat until the tomatoes soften.",
                "Then add coriander powder, turmeric powder, garam masala powder, red chili powder and black pepper powder.",
                "Mix again very well so that the ground spice powders gets mixed evenly with the rest of the mixture. Sauté for a minute.",
                "Add sliced mushrooms. Stir again. Sauté on a low to medium heat for 6 to 8 minutes. Keep on stirring at intervals.",
                "Then add water. Bring the mixture to a simmer.",
                "Add the rice. Add rest of the chopped mint and coriander leaves. Mix again.",
                "Season with salt. Check the taste of the stock and it should taste a bit salty.",
                "Cover the pan with a lid. On a low heat cook the biryani until the rice grains are tender, fluffy and all the water has been absorbed.",
                "If the rice grains are undercooked and the water has dried up, add about ¼ to ½ cup hot water of more as needed.",
                "You have to keep on checking the rice a couple of times to see if the water dries up or not.",
                "Once done, allow the biryani to rest for 5 minutes. Then open the lid and gently fluff the rice before serving.",
                "First rinse rice very well in water for a couple of times. Then soak the rice in water for 20 to 30 minutes.",
                "After 20 to 30 minutes, drain the water from the rice grains. Add 1 teaspoon ghee to the soaked rice.",
                "Mix and coat the rice with ghee very well and allow to marinate for 10 to 15 minutes. Instead of marinating, you can also sauté the rice in ghee lightly in a pan on low heat.",
                "When you keep the rice for soaking, prep the remaining ingredients. First rinse or wipe dry and then quarter or slice the mushrooms. Take the mushroom in a mixing bowl and set aside.",
                "Slice thinly the onions. Chop the tomato. Also chop the green chilies, garlic cloves and ginger. Chop mint and coriander leaves as well.",
                "In a small grinder or chutney grinder, take the chopped mint leaves, coriander leaves, green chilies, garlic and ginger.",
                "Add ½ to 1 tablespoon water or as required. Blend to a smooth paste.",
                "Add this ground green paste with the curd to the chopped mushrooms.",
                "Sprinkle turmeric powder, red chilli powder, garam masala powder and coriander powder.",
                "Gently mix all the ingredients with the mushrooms. Cover and set aside to marinate for 20 to 30 minutes.",
                "Heat 2 to 2.5 tbsp oil in a thick bottomed pot or pan. Add the whole spices and fry them for a few seconds or until they are fragrant.",
                "Then add the sliced onions. Mix very well and sauté them on a low to medium heat. Add a pinch of salt for quick cooking of the onions.",
                "Stir often and sauté until the onions become golden.",
                "Add tomatoes. Stir and sauté the tomatoes for about 2 minutes.",
                "Add the marinated mushrooms. Mix very well and sauté the mushrooms for 6 to 7 minutes or until they shrink and you see oil specks on top.",
                "In the bowl where the mushrooms were marinated, there will be some marinade left. Add 1 cup water and mix the marinade with the water.",
                "Add water as required depending on quality of rice. You can add from ½ to 1 cup water. I used organic basmati rice, so I added 1 cup of water.",
                "Add this water to the mushrooms. Also add 1 cup coconut milk. Mix very well.",
                "Season with salt and stir. On a medium heat bring the mixture to a boil.",
                "Then add the ghee coated rice. Mix again gently.",
                "On a low heat cook until the rice grains are tender and soft.",
                "It took me 12 minutes for the rice to cook. Depending on the thickness and depth of pan, quality of rice and flame intensity, it can take about 10 to 12 minutes to cook rice.",
                "Once the rice grains are tender, cover and allow to stand for 5 minutes before serving mushroom biryani. Then gently fluff the rice with a fork.",
                "Garnish with mint or coriander leaves and serve Chettinad mushroom biryani with a side salad or raita.",
                "Both the mushroom biryanis are best served with a side of raita. Choose to make any of your favorite raita.",
                ",",
                ",",
                "or",
                "are some of the options. Simple plain curd (yogurt) also tastes good with the biryani.",
                "You can garnish any of the biryanis with mint or coriander leaves. If you do not like raita or yogurt, pair with a few lemon wedges and a fresh",
                "and a roasted or fried papadums.",
                "Both the biryanis have a lot of spices and are really flavorful, so I would recommend serving them without any curry or gravy. You can also enjoy the biryani as it without any sides.",
                "Any leftovers can be stored in the refrigerator for 1 day. Keep the biryani in a covered container.",
                "While reheating, either sauté until warm or hot in a skillet or steam for 5 minutes in a pot or an Instant Pot."
            ],
            "Description": "Mushroom biryani is the classic vegetarian version of biryani with meaty mushrooms, tender fluffy rice and flavorful spices. I share two delectable mushroom biryani recipes from the South Indian cuisine. These recipes requires only one pot and are made in less than forty five minutes! A spicy, tasty mushroom and rice recipe, these vegetarian mushroom biryanis are perfect for a delicious weeknight meal.",
            "Prep Time": "20 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "Chettinad, South Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Matar Mushroom",
            "Ingredients": "200, grams, button mushrooms, 2/3 or ¾, cup, fresh or frozen peas, *check notes, 3, medium sized tomatoes,, finely chopped, 1, medium sized onion,, finely chopped, 1, green chili,, chopped, ¼ or ½, teaspoon, red chili powder, ½, teaspoon, turmeric powder, ¼ or ½, teaspoon, or punjabi garam masala, 1, teaspoon, 1.5, teaspoon, or crushed ginger-garlic, 2, cups, water, or as required. reduce the amount of water to 1 cup if using tender or frozen peas * check notes, 2 to 3, tablespoon, oil, salt as required",
            "Instructions": [
                "Stir and saute for 2 to 3 mins. Then add water and salt. Add water as required. If using tender or frozen peas, then reduce the water to 1 cup. If using peas which are not tender or old, then add 2 cups of water or as required.",
                "In case there is too much water even after the peas or mushrooms are cooked, then reduce the water by simmering the matar mushroom curry without a lid for some more minutes till you get the desired consistency.",
                "In case the water become less, then add some more water. The consistency is a semi dry gravy or curry. So before the gravy reaches this consistency, the peas and mushrooms should be cooked well. So add water or reduce the water from the matar mushroom gravy accordingly."
            ],
            "Description": "Matar mushroom recipe with step by step photos. This is a semi-dry delicious vegetable dish made with green peas, mushrooms, onions, tomatoes, herbs and spices. It makes for a delicious and healthy meal when served with a side of chapati or naan. Vegan and gluten-free.",
            "Prep Time": "10 minutes",
            "Cook Time": "35 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Methi Mushroom – Mushroom and Fenugreek (Methi) Curry",
            "Ingredients": "200 to 250, grams, button mushrooms, ¼, cup, (yogurt), fresh and full-fat or made with whole milk, 1, cup, fenugreek leaves, (methi leaves) or 1 to 2 tablespoons dry fenugreek leaves ( ), 3, tablespoons, oil, or ghee, ½, cup, chopped onions, or 1 medium-sized onion, 1 or 2, green chili, – sliced or chopped or 1 teaspoon chopped, ½, tablespoon, 3, tomatoes, – medium-sized, chopped or 1.25 to 1.5 cups chopped tomatoes, ½, teaspoon, turmeric powder, 1, teaspoon, (ground coriander), ½, teaspoon, red chili powder, or cayenne pepper, salt, as required, ¼ to ½, cup, water, or add as required, 2 to 3, green cardamoms, 1, inch, cinnamon, 1, black cardamom, 1, tej patta, (Indian bay leaf), 2 to 3, cloves, 1 to 2, single strands of, mace, – optional",
            "Instructions": [
                "Rinse the mushrooms in running water a few times and get rid of the mud from them. Drain all the water very well.",
                "Chop them and keep aside.",
                "In a bowl take ¼ cup curd and a pinch of salt to it. Beat the curd with a small wired whisk till smooth. Use full fat fresh curd so that the curd does not split while cooking.",
                "Add the mushrooms to the curd and marinate for 30 to 40 minutes.",
                "Meanwhile pluck the fenugreek leaves from their stems.",
                "In a bowl soak the leaves in water for 4 to 5 minutes so that the mud etc from the leaves settles down at the bottom.",
                "Throw the water and again soak the leaves for 1 to 2 minutes.",
                "Now rinse the methi leaves well under running water till the leaves are clean and the mud particles are not there.",
                "Drain them in a colander. Chop the methi leaves finely.",
                "Heat oil or ghee in a pan or kadai (wok).",
                "Add the whole spices – black cardamom, cinnamon, green cardamoms, cloves, tej patta and mace.",
                "Fry the spices till the oil becomes fragrant and the spices splutter. Don't burn them. Fry spices on a low heat.",
                "Add onions and stirring often sauté them on low to medium-low heat till they begin to get golden.",
                "Be patient as onions do take time to get browned. Keep stirring the onions in between.",
                "Once the onions begin to get golden brown, add chopped green chilies and ginger-garlic paste. Sauté for a minute on low heat.",
                "Now add the tomatoes. Sauté them on low to medium-low heat till they become soft and mushy. Keep on stirring the masala base.",
                "Add all the dry spice powders – turmeric, coriander and red chili powder. Mix well.",
                "Then sauté stirring often till oil leaves from the sides of the whole masala mixture.",
                "Lower the heat and add the marinated mushrooms.",
                "Also add the chopped methi leaves or dry methi leaves (kasuri methi). Mix again.",
                "Add about ¼ to ½ cup of water. Also add salt as per taste. Do keep in mind that some salt has been added to the marination.",
                "Stir, cover the pan or kadai and simmer for about 8 to 10 minutes on low heat till the mushrooms are tender and cooked.",
                "Once the mushrooms are cooked and the curry has a medium consistency then check the taste and add salt if required.",
                "Garnish methi mushroom with some chopped coriander leaves.",
                "Serve methi mushroom hot or warm with roti or naan."
            ],
            "Description": "I always enjoy a good alliteration, especially when I find one as tasty as this Methi Mushroom. This deliciously creamy methi curry is made using button mushrooms, fenugreek leaves, curd, herbs & spices for a lovely vegetarian take on a North Indian classic.",
            "Prep Time": "15 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Soup Recipe (Cream of Mushroom Soup)",
            "Ingredients": "200 to 250, grams, button mushrooms, or cremini mushrooms, ⅓, cup, finely chopped onions, or 1 small to medium-sized onion, ½, teaspoon, finely chopped garlic, or 2 to 3 small to medium-sized garlic, 1, tejpatta, (Indian bay leaf) or bay leaf, 1 to 2, pinches, ground nutmeg powder, or grated nutmeg, 1, cup, water, or vegetable stock, 1, cup, whole milk, – at room temperature, 6, tablespoons, light cream, or 3 tablespoons whipping cream or heavy cream, 1, tablespoon, whole wheat flour, or all-purpose flour, 2, tablespoons, 1, tablespoon, chopped parsley, or coriander leaves (cilantro) or any fresh soft herbs like basil, freshly crushed black pepper, as required, salt, as required, 1, teaspoon, finely chopped parsley, – can also use the same herb you add in the soup for garnishing like coriander leaves or basil",
            "Instructions": [
                "Rinse or wipe white button mushrooms or cremini mushrooms. Slice of the lower part of the base stalk of each mushroom. Then chop them in halves or quarters, or slice them thin.",
                "Peel, rinse and chop onion and garlic finely. Get all the other ingredients ready and set them aside.",
                "Melt butter in a heavy saucepan.",
                "Add the bay leaf and saute till fragrant for about 2 to 3 seconds.",
                "Add the finely chopped onions and garlic.",
                "Sauté stirring often on medium-low heat till the onions soften and become translucent.",
                "Saute till all the water dries up and the mushrooms become a light golden.",
                "Add the flour and saute for 3 to 4 minutes stirring often on a low to medium-low heat. The raw aroma of flour should not be felt.",
                "Then add freshly crushed black pepper and mix well.",
                "On a low to medium-low heat let the soup come to a gentle simmer first.",
                "The mushroom soup would also begin to thicken. Stir at intervals.",
                "Further simmer for about 4 to 5 minutes till the soup thickens more.",
                "Simmer mushroom soup or 1 to 2 minutes more stirring often.",
                "Lastly, sprinkle ground nutmeg powder and stir.",
                "Switch off the heat and pour the soup in serving bowls.",
                "Serve the cream of mushroom soup steaming hot garnished with parsley or coriander.",
                "Serve the mushroom soup with a side of any sandwich or crusty bread or toast. Crostini or bruschetta also pair well. You can also serve as a starter with a pasta or pilaf main course.  Enjoy the soup with a side salad of fresh veggies.",
                "Keep any leftover soup for 1 to 2 days in an airtight container in the refrigerator. The consistency will thicken more after refrigeration. Add a splash of water while reheating to loosen the consistency."
            ],
            "Description": "Rich and delicious mushroom soup is wonderfully satisfying to enjoy any time of the year. It’s a hearty soup recipe prepared in just one pot, and is perfect to make even on a busy weeknight in only 30 minutes. Here you’ll find step-by-step instructions and photos with a video to make my savory, creamy, absolutely delightful cream of mushroom soup from scratch.",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "World",
            "Course": "Side Dish, Starters"
        },
        {
            "Title": "Mushroom Kurma",
            "Ingredients": "½, cup, grated coconut, or ⅓ cup desiccated coconut, 10 to 12, cashews, (kaju), ⅓, cup, water for soaking cashews, ⅓, cup, water, for grinding coconut and cashews, 51, grams, onion, or 1 medium onion chopped or ⅓ cup chopped onions, 105, grams, tomatoes, or 1 large tomato chopped or 1 cup finely chopped tomatoes, 200 to 250, grams, mushrooms,, sliced or chopped, 1, teaspoon, or 3 to 4 medium garlic cloves and ½ inch ginger crushed to a paste in mortar pestle, 2, tablespoon, oil, (can use peanut oil or sunflower oil), ½, teaspoon, mustard seeds, ½, teaspoon, cumin seeds, ½, teaspoon, urad dal, (split husked black gram), 8 to 10, fenugreek seeds, (methi dana) – optional, ½, teaspoon, turmeric powder, 1, teaspoon, kashmiri red chilli powder, or red chilli powder, 1, teaspoon, (ground coriander), 1, teaspoon, 10 to 12, curry leaves, or 1 sprig of curry leaf (kadi patta), 2, cups, water, or add as required, salt as required, 1, tablespoon, chopped coriander leaves for garnish",
            "Instructions": [
                "Soak cashews in hot water for 15 minutes. Soaking cashews helps to grind them better, especially if you have a blender or mixer-grinder which has difficulty grinding nuts and seeds.",
                "But if you do not have time to soak, then just chop them and grind with coconut.",
                "Heat 2 tablespoon oil. You can use peanut oil or sunflower oil. Add teaspoon mustard seeds. On a low to medium flame saute till they begin to crackle.",
                "Once they begin crackling, then add teaspoon cumin seeds, 8 to 10 fenugreek seeds and 1/2 teaspoon urad dal. If you do not have fenugreek seeds, then skip them.",
                "Then add turmeric powder, red chilli powder, coriander powder and garam masala powder",
                "Cover the pan with a lid and simmer for 14 to 15 minutes.",
                "When the mushroom kurma is done, you will see specks of oil floating on top and the curry will also thicken a bit.",
                "Garnish with some chopped coriander leaves and serve mushroom kurma hot with steamed rice, chapatis or pooris or paratha. It will also go well with cumin rice or saffron rice."
            ],
            "Description": "Mushroom kurma recipe with step by step photos. This is a delicious one pot recipe of South Indian style mushroom kurma curry made with white button mushrooms in a coconut-cashew base and Indian spices-herbs. Gluten-free and vegan recipe.",
            "Prep Time": "15 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "South Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Rice",
            "Ingredients": "2, cups, cooked rice, or ⅔ cup uncooked rice – preferably basmati rice or any long grained rice, 400, grams, white button mushrooms, – cleaned and chopped or 4 cups chopped white button mushrooms, 2, tablespoon, extra virgin olive oil, 1, teaspoon, roasted crushed sesame seeds, ½, teaspoon, thyme, ½, teaspoon, oregano, 3 to 4, spring onions, or scallions – chopped (reserve the greens for garnishing) – about ½ cup, 1, teaspoon, garlic, , finely chopped – optional, ¼, teaspoon, ground black pepper, or white pepper, salt, as required",
            "Instructions": [
                "Before you begin the recipe, cook about ⅔ cup of rice until tender and softened. Cool the rice grains completely.",
                "You can cook or steam the rice in a stovetop pressure cooker, pan or Instant pot adding water as needed.",
                "In a pan heat olive oil. You can also use any neutral flavored oil.",
                "Add the chopped garlic and saute for some seconds. No need to brown the garlic.",
                "Then add chopped scallions (spring onion whites). Begin to saute the spring onions stirring often.",
                "Saute till the spring onions become translucent and have softened. Now add chopped mushrooms. Initially the mushrooms will leave water.",
                "Saute them until all the water evoapartes from the pan and the mushrooms are completely cooked.",
                "Add ground black or white pepper, crushed white sesame seeds, thyme and oregano to the mushrooms. Mix well.",
                "Now add the cooked rice and salt as required. The rice has to be completely cooled before you add it at this step.",
                "Mix and saute the rice with the mushrooms for a couple of minutes.",
                "Garnish with the scallions greens or cilantro.",
                "Serve mushroom rice hot or warm with a salad or you could just drizzle some extra virgin olive oil to the rice and enjoy the bowl of mushroom rice."
            ],
            "Description": "This Mushroom rice is easy and a flavorful recipe of sauteed button mushrooms, spices and herbs mixed with cooked rice. The vegan mushroom rice is made in European style and is also gluten-free. Makes for a wholesome lunch or dinner.",
            "Prep Time": "20 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "World",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Do Pyaza (Mushrooms with Onions)",
            "Ingredients": "3, tablespoons, oil, – any neutral oil, 200, grams, onions, or 2 large or ¾ cup onions cut in one inch square and ½ cup finely chopped onions, 1, small to medium tej patta, (Indian bay leaf), ½, teaspoon, 150, grams, tomatoes, or 2 medium to large or 1 cup finely chopped tomatoes, ¼, teaspoon, turmeric powder, ½, teaspoon, red chilli powder, or cayenne pepper, ½, teaspoon, (ground coriander), ½, teaspoon, cumin powder, (ground cumin), 200, grams, button mushrooms, or about 2.5 cups chopped or sliced, salt, as required, ½, teaspoon, 1 to 2, green chillies, or half or quarter portion of 1 anaheim or serrano pepper – slit or sliced, 3, tablespoons, chopped coriander leaves, (cilantro), 1 to 2, tablespoons, chopped coriander leaves, –  for garnish",
            "Instructions": [
                "Peel and rinse the onions. Chop one onion and if required some portion of the second onion, in one inch squares. You will need ¾ cup onion squares.",
                "Finely chop the remaining onion. You will need ½ cup finely chopped onions.",
                "Also finely chop the tomatoes and slice or chop the button mushrooms",
                "Heat 3 tablespoons oil in a kadai or pan.",
                "Add the onions which have been cut into squares. On a medium-low or medium heat, begin to sauté the onions.",
                "Stir at intervals while sautéing the onions until their edges turn golden.",
                "Remove the onions with a slotted spoon and transfer on a plate.",
                "Lower the heat and in the same pan, add 1 small to medium tej patta.",
                "Add the finely chopped onions and sauté until translucent or light golden.",
                "Then add ginger-garlic paste.",
                "Mix well and sauté for some seconds until the raw aroma of ginger-garlic goes away.",
                "Now add the finely chopped tomatoes. Mix very well and sauté for a minute.",
                "Add turmeric powder, red chilli powder or cayenne, coriander powder and cumin powder. Mix very well.",
                "Sauté the masala, stirring often until the tomatoes soften and become mushy. If the masala ingredients start sticking to the pan, add a few splashes of water. Mix, deglaze and continue to sauté .",
                "Add the chopped button mushrooms and salt as needed.",
                "Mix very well. Sauté the mushrooms on a low to medium heat.",
                "First the mushrooms will release plenty of water. Continue to sauté until the water dries up and the mushrooms are cooked. The gravy will also look thick.",
                "Now add the lightly caramelized onion squares. Mix again.",
                "Add garam masala powder, chopped coriander leaves and green chilies (slit or sliced).",
                "Mix very well and then switch off the heat.",
                "Enjoy mushroom do pyaza hot or warm with a side of roti, naan, paratha, bread or dinner rolls. Garnish with some coriander leaves while serving and if you like, drizzle some lemon juice on it.",
                "For a smaller period of a few hours, you can pack this in a lunch box with a side of bread or roti.",
                "Make sure that you store any leftover in the fridge for a day only. Store in a covered steel container or box.",
                "While reheating, warm in a frying pan, adding a few splashes of water as the gravy will become too thick or look dried."
            ],
            "Description": "Mushroom do pyaza recipe is a flavorsome, delightful dish featuring button mushrooms cooked with lightly caramelized onions, tomatoes and ground spices. Make this easy vegan, gluten-free recipe with simple everyday Indian ingredients in less than 30 minutes. Wow yourself and your family. Trust me, it is yum!",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Stir Fry (One Pot Indian Style)",
            "Ingredients": "200 to 250, grams, white button mushrooms,, rinsed and chopped, 1.5 to 2, tablespoon, oil, ½, teaspoon, cumin seeds, – crushed lightly, 2, medium sized onions, or 130 to 135 grams onions, thinly sliced, ⅛, teaspoon, turmeric powder, or about 2 to 3 pinches turmeric powder, ½, teaspoon, kashmiri red chili powder, ½, teaspoon, 1, teaspoon, (ground coriander), 1, green chili, – sliced or chopped, salt as per taste, 1 to 2, tablespoon, chopped coriander leaves, (cilantro leaves)",
            "Instructions": [
                "Slice 2 medium sized onions. You will need 130 to 135 grams thinly sliced onions.",
                "Also chop or sliced white button mushrooms. you can wipe the mushrooms with a clean kitchen towel and then chop or you can rinse them in water and then chop.",
                "I take each mushroom and rinse it well to remove the mud particles. Then slice the stalk a bit and chop the mushrooms. I also slice bruised part if any in the mushrooms.",
                "Then add the chopped or sliced white button mushrooms.",
                "Mix the spices very well with the mushrooms. season with salt as per taste.",
                "Serve indian style mushroom stir fry with chapatis, parathas or bread."
            ],
            "Description": "Mushroom stir fry recipe with step by step photos. One pot dishes are the best fix for days when you don’t have the energy to go elaborate in cooking. This One Pot Indian Style Mushroom Stir Fry is just one such mushroom recipe that gets done in the most fuss-free way. The recipe is also vegan friendly.",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Pepper Fry",
            "Ingredients": "2, tablespoons, coconut oil, (can also use sunflower oil or peanut oil), ½, teaspoon, mustard seeds, 92, grams, onions, or 1 large onion or 1 cup thinly sliced onions, ½, teaspoon, 250, grams, white button mushrooms, – rinsed and chopped or sliced, 115, grams, capsicum, or 1 medium to large bell pepper or 1 cup sliced bell peppers, 1, green chili, sliced or chopped, 9 to 10, curry leaves, (chopped) or 2 teaspoons chopped curry leaves, can also add 1 teaspoon curry leaves or 4 to 5 curry leaves (chopped), 1, tablespoon, black peppercorns, – crushed to a coarse powder in a small grinder, 1, teaspoon, fennel seeds, – crushed to a coarse powder in a small grinder, ½, teaspoon, (ground coriander), ½, teaspoon, cumin powder, (ground cumin), 1, pinch, turmeric powder, (ground turmeric), salt, as required, 2, tablespoons, chopped coriander leaves, (cilantro)",
            "Instructions": [
                "Grind to a coarse powder. Set aside.",
                "Also slice and chop the onion, mushrooms, capsicum and chillies. Rinse the mushrooms before chopping them.",
                "Heat coconut oil in a frying pan. Keep heat to a low.",
                "Add mustard seeds and let them crackle.",
                "Mix the onions very well and sauté on a low to medium heat, till they start to turn light golden.",
                "Then add ginger-garlic paste and sauté for a few seconds till the raw aroma of ginger-garlic goes away.",
                "Mix very well and sauté mushrooms on a medium heat.",
                "Sauté the capsicum slices till they are half-cooked. They should have some crunch in them.",
                "Then add sliced or chopped green chillies and chopped curry leaves. Mix well.",
                "Now add the coarsely powdered black pepper and fennel seeds together with coriander powder, cumin powder and a pinch of turmeric powder.",
                "Mix again and then switch off the heat. Check the taste of mushroom pepper fry. Add more salt if required.",
                "Add 2 tablespoons chopped coriander leaves. Stir to mix.",
                "Serve mushroom pepper fry hot with chapati or roti."
            ],
            "Description": "Most of the vegetarians I know, really dig into mushrooms! If you too consider yourself as a",
            "Prep Time": "15 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Kerala, South Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Noodles",
            "Ingredients": "200, grams, noodles, 300 to 400, grams, mushrooms, or 3 to 4 cups sliced mushrooms, ½, tablespoon, chopped garlic, ½, tablespoon, chopped ginger, 1, teaspoon, chopped green chilies, – about 1 to 2 green chilies chopped, ½, teaspoon, black pepper, or white pepper, ½, cup, chopped spring onions, 1 to 2, teaspoon, finely chopped celery, (optional), 2 to 2.5, tablespoon, oil, 1, tablespoon, soy sauce, or add as required, ½, teaspoon, rice vinegar, or regular vinegar, 2, tablespoon, spring onion greens, for garnish, salt as required",
            "Instructions": [
                "Heat enough water in a pan with salt and a few drops of oil, till it comes to a boil. Add the noodles and cook according to the package instructions. You can use hakka noodles or instant noodles for this recipe. Even whole wheat noodles will work.",
                "When the noodles are cooking, rinse and chop mushrooms, spring onions and herbs. Or you can chop them before you start cooking the noodles.",
                "Once the noodles are cooked then drain the water and rinse the noodles in running water, so that the noodles stop cooking. Drain all the water again.",
                "Then add oil and gently mix, so that the oil gets evenly coated on the noodles. Cover and keep the noodles aside.",
                "Heat oil in a wok or kadai or a pan. On a low to medium heat, first add chopped garlic, chopped ginger and chopped green chilies. For a spicy hot tasting noodles, you can increase the quantity of green chilies.",
                "Saute for a few seconds, then add chopped spring onions. Add both the white and green part. Reserve 2 tablespoon of the greens for garnish.",
                "Stir and saute the spring onions till they turn translucent. Then add the sliced mushrooms.",
                "Stir the mushrooms very well and saute them on a medium to high heat stirring occasionally. The mushrooms will leave water while cooking.",
                "Then add ground black pepper. You can also use white pepper instead of black pepper.",
                "Add soy sauce and stir very well. Add the noodles. Add salt as required.",
                "Stir and toss the noodles very well. Add rice vinegar or regular white vinegar. Stir and mix.",
                "Switch off the heat and lastly add the chopped spring onions greens.",
                "Give a final stir and serve mushroom noodles plain or with dry veg manchurian or veg manchurian gravy or veg balls in hot garlic sauce."
            ],
            "Description": "These Quick Vegan Mushroom Noodles will soon become your favorite go-to recipe! This dish includes button mushrooms, spring onions, soy sauce, spices and noodles. Make these simple Chinese-style stir-fried mushroom noodles in less than 30 minutes and serve as a main.",
            "Prep Time": "10 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Indo Chinese",
            "Course": "Brunch, Side Dish"
        },
        {
            "Title": "Stuffed Mushrooms Recipe (Wholesome & Easy)",
            "Ingredients": "400, grams, white button mushrooms, or cremini mushrooms, ⅓, cup, onion, finely chopped or 1 medium onion, 1, teaspoon, garlic, – finely chopped, ½ to 1, tablespoon, olive oil, ½ to ¾, teaspoon, crushed black pepper, ½, teaspoon, dried basil, ¼, teaspoon, dried oregano, salt, as required, grated processed cheese, or cheddar cheese or mozzarella cheese as required, spring onion greens, or garlic greens (chives) or parsley or coriander leaves, for garnish",
            "Instructions": [
                "First rinse and wipe dry the white button mushrooms. Slice off a bit of the muddy part of the stalks and discard them.",
                "Then just break stalk from each of the mushrooms.",
                "Keep the stalks as well as the mushroom caps aside. Optionally you can brush the mushroom stalks lightly with olive oil.",
                "Heat ½ to 1 tablespoon olive oil in a pan. Add 1 teaspoon of the finely chopped garlic.",
                "Sauté the garlic for some seconds on a low heat. No need to brown them.",
                "Then add ⅓ cup of the finely chopped onions.",
                "Begin to sauté the onions on a low to medium heat, till they become light golden or golden.",
                "Mix very well and sauté on a medium heat. The mushrooms would first release some moisture or water.",
                "Then add ½ to ¾ teaspoon of crushed black pepper, ½ teaspoon dried basil and ¼ teaspoon dried oregano.",
                "You can also use your choice of dried herbs or add fresh herbs.",
                "Also season with salt according to taste.",
                "Mix very well and switch off the heat. At this point you can add about 2 to 3 tablespoons of breadcrumbs to the stuffing if you like.",
                "Let the mushroom stuffing become warm or cool down. Taste and if required add more herbs, black pepper or salt.",
                "Now with a small spoon place the stuffing in each mushroom cap.",
                "Before you begin stuffing the mushroom caps, preheat your oven at 180 degrees celsius for 15 to 20 minutes.",
                "Grease a baking tray with some olive oil. You can also use butter instead of olive oil for greasing the baking tray.",
                "Place the stuffed mushroom caps on a baking tray.",
                "Keep the baking tray in the preheated oven. If you prefer, drizzle a bit of olive oil on the stuffed mushrooms in the baking tray.",
                "Bake for 180 degrees celsius for 15 to 20 minutes.",
                "You need to bake till the mushrooms shrink a bit in size and water starts releasing from them. The cheese will also melt and the color of the mushrooms will darken.",
                "Allow to cool for a few minutes and then serve stuffed mushrooms hot as starter dish with any dip or chutney or sauce.",
                "Do not serve after the mushrooms cool down as they become too soggy and soft. So they are best had when they are hot.",
                "You can garnish with some spring onion greens or chives or fresh herbs while serving."
            ],
            "Description": "Creamy, umami, and perfectly filling, this recipe for Vegetarian Stuffed Mushrooms with herbs and cheese is one of our favorite Italian-inspired appetizers. Simply made with fewer than 10 ingredients, this easy starter will be ready for eating in just 45 minutes.",
            "Prep Time": "25 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "American, World",
            "Course": "Snacks, Starters"
        },
        {
            "Title": "Chilli Mushroom (Stovetop & Instant Pot)",
            "Ingredients": "200 to 250, grams, button mushrooms, or baby portabella mushrooms, 1 to 2, spring onions, (small to medium-sized scallions), halved or quartered and the white layers removed (reserve greens for garnish) or 1 small to medium onion, chopped, 2 to 3, green chilies, – slit, ¼, cup, chopped capsicum, chopped into squares or cubes (optional) – can use red or green, yellow or red bell peppers, 2, teaspoons, finely chopped garlic cloves, or 7 to 8 small to medium garlic cloves, 1, teaspoon, finely chopped ginger, or 1 inch ginger, 1, tablespoon, soy sauce, (naturally brewed) or as required, ½, tablespoon, toasted sesame oil, or any neutral oil – for the sauce, ½ to ¾, teaspoon, cornstarch, 1 to 2, teaspoons, water, ½ to 1, teaspoon, sugar, or as required, salt, as required, crushed black pepper, as required, oil, – for shallow frying mushrooms, any neutral oil, as required, 5 to 6, tablespoons, whole wheat flour, or all-purpose flour, 3, tablespoons, cornstarch, ¼ to ½, teaspoon, crushed black pepper, or add as required, salt, as required, ¼ to ⅓, cup, water, or add as required, 2, tablespoons, toasted sesame oil, or any neutral flavored oil, ½, tablespoon, finely chopped garlic, ½, tablespoon, finely chopped ginger, 2 to 3, green chilies,, sliced diagonally or slit, ¼, cup, 1, teaspoon, finely chopped celery, – optional, 200 to 250, grams, white button mushrooms, quartered or chopped, ⅓, cup, sliced green bell pepper, – capsicum, ½, cup, water, or vegetable stock, add more if required, 1, tablespoon, finely chopped scallions greens, or spring onion greens, 1, tablespoon, or 2 teaspoons soy sauce – add less or more as you prefer, 2, teaspoons, red chilli sauce, 2, teaspoons, green chilli sauce, 1, teaspoon, rice vinegar, or apple cider vinegar or white vinegar, ¼ to ½, teaspoon, freshly crushed black pepper, or ground black pepper or white pepper, ½, teaspoon, sugar, or add as required, ¼, teaspoon, salt, or add as required, 2, teaspoons, 1, tablespoon, water, few finely chopped scallion greens, or spring onion greens",
            "Instructions": [
                "Quarter them if larger in size and halve them if medium-sized. Keep the smaller ones intact and whole.",
                "Fry the batter coated mushrooms in batches and drain on paper towels to remove excess oil.",
                "In another wok (kadai) or pan, heat toasted sesame oil.",
                "Add the spring onion whites and capsicum. Stir fry on medium or high heat for a minute.",
                "Add the finely chopped ginger, garlic and green chilies.",
                "Stir fry on a high heat until you see the onions getting browned at the edges. If the heat becomes too much then reduce it.",
                "Reduce the heat. Add the soy sauce, salt, sugar, black pepper and stir fry for half a minute.",
                "Add the fried batter coated mushrooms and stir on a low to medium heat.",
                "Sprinkle about 1 to 2 teaspoons of water and ½ to ¾ teaspoons cornstarch on the mushrooms.",
                "Mix very well and sauté for a minute or two. Continue to stir. This gives a nice glaze to the mushrooms.",
                "Switch off the heat and serve the chili mushroom hot with veg fried rice, bread or even roti or naan.",
                "Garnish with spring onion greens while serving.",
                "In a small bowl take all the sauce, salt, sugar, pepper and mix very well. Keep aside.",
                "Press the sauté button on less for 7 to 8 minutes on the instant pot.",
                "Let it display hot and then add 2 tablespoons oil.",
                "Now add the ginger, garlic and green chilies and sauté on less mode for 1 to 2 minutes.",
                "Add the chopped scallions (spring onions) and celery.",
                "Press sauté again and set to normal mode. Sauté onions for minute.",
                "Add chopped mushrooms (200 to 250 grams) and ⅓ cup sliced bell pepper (capsicum).",
                "Sauté for 2 minutes stirring often. If the onions, ginger and garlic, etc start sticking at the bottom, then change the sauté heat setting to less.",
                "Add the prepared sauce mixture and mix very well.",
                "Add water or vegetable stock. Mix again.",
                "Cancel the sauté mode. Secure the instant pot with its lid and position the steam release handle to sealing. Press the pressure cook button on high pressure and set the time for 5 minutes.",
                "Meanwhile, make a slurry or paste by mixing 2 teaspoons tapioca starch or corn starch or potato starch with 1 tablespoon water. Keep aside.",
                "After 5 minutes, do a quick pressure release and then open the lid.",
                "Stir the prepared slurry and add it to the mushrooms. Mix again very well.",
                "Press the sauté button again on normal mode for 1 to 2 minutes.",
                "Let the sauce simmer for 1 to 2 minutes or more till the sauce or gravy thickens and the rawness of the starch is not felt. If gravy becomes too thick add some hot water.",
                "Once the sauce gets thickened, press cancel button. Sprinkle some scallion greens or spring onion greens. Stir and mix.",
                "Check the taste and add bragg's liquid amino or soy sauce, sugar, salt or crushed black pepper more if required.",
                "Serve instant pot chilli mushroom gravy hot with bread rolls, fried rice, noodles or fettuccine pasta. garnish with some finely chopped scallion greens while serving."
            ],
            "Description": "Chilli mushroom is a delicious vegetarian dish that combines bright Indian and Chinese flavors. There are two simple versions that can be made: The first is a recipe for lightly fried mushrooms perfect for dipping, and the second is a healthy saucy variation that’s great with rice. Either one is wonderfully easy to make and delicious to enjoy as an appetizer, side, or snack! Here you’ll find step-by-step instructions with photos to make your choice of chilli mushroom recipe.",
            "Prep Time": "20 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Indo Chinese",
            "Course": "Starters"
        },
        {
            "Title": "Mushroom Tikka Masala",
            "Ingredients": "200 to 250, grams, buttton mushrooms, 4, tablespoon, (thick curd) or hung curd made from ½ cup fresh curd (yogurt), 1/8, teaspoon, turmeric powder, or 2 to 3 pinches of turmeric powder, ½, teaspoon, ½, teaspoon, kashmiri red chili powder, or deghi mirch, ½, teaspoon, chaat masala powder, 1 to 1.5, teaspoon, or 3 to 4 garlic cloves and ½ inch ginger – crushed to a paste in mortar-pestle, ½, teaspoon, ajwain, (carom seeds), ¼, teaspoon, lemon juice, ½, tablespoon, oil,, to be used only if grilling or baking the mushrooms in the oven, ½, tablespoon, besan, (gram flour), 3 to 4, tablespoon, oil, for sauteing mushrooms, black salt, or rock salt or regular salt as required, some oil for brushing while grilling, (optional), 200, grams, tomatoes, or 3 medium to large tomatoes, 8 to 10, cashews, hot water as required, 80 to 100, grams, onion, or 1 medium to large onion or about ½ cup finely chopped onion, 1, teaspoon, or 2 to 3 garlic cloves and ½ inch ginger – crushed to a paste in mortar-pestle, 1, small to medium capsicum, (green bell pepper) or about 1/3 cup chopped capsicum, 1 or 2, green chilies, – slit, ¼, teaspoon, turmeric powder, ½, teaspoon, kashmiri red chili powder, ½, teaspoon, cumin powder, ½, teaspoon, ¼, teaspoon, 1 to 2, pinch, grated nutmeg or nutmeg powder, 1, teaspoon, kasuri methi, (dry fenugreek leaves) – crushed, 2 to 3, tablespoon, low fat cream, or whipping cream, 1 to 2, tablespoon, chopped coriander leaves",
            "Instructions": [
                "We will need hung curd/yogurt or thick yogurt for this recipe.",
                "I used 1/2 cup fresh curd and strained it in a muslin cloth with a light weight kept on it, overnight in the fridge. From 1/2 cup fresh curd, I got 4 tbsp hung curd. If using thick curd, then also use 4 tbsp of it.",
                "Meanwhile add 2 large tomatoes and 8 to 10 cashews in a bowl containing hot water. Cover and keep aside for 20 to 30 minutes.",
                "The tomatoes will get blanched and the cashews will soften. You can heat the water on a stove top, in a microwave or in an electric heater.",
                "Let each side of the mushrooms get cooked a bit and then turn over.",
                "Use a well seasoned pan or non stick pan for sauteing the mushrooms, otherwise the marinade sticks to the pan. Saute the mushrooms on a low to medium flame.",
                "Turn over and saute so that each side gets browned and cooked well.",
                "A time will come when the mushrooms will begin to release water and the oil will begin to splutter.",
                "Just cover the pan with a lid half way and continue to cook the mushrooms.",
                "Saute till mushrooms are nice golden and crisp.",
                "Now add 1/3 cup chopped capsicum (green bell pepper) and slit 1 to 2 green chilies. Green chilies give the dish some heat. Skip if making for kids and if you cannot tolerate heat.",
                "Bring the curry or gravy to a simmer for 4 to 5 minutes.",
                "Add 1/4 tsp garam masala powder, a pinch or two of grated nutmeg or nutmeg powder and 1 tsp kasuri methi (crushed).",
                "Stir very well and then switch off the flame.",
                "Check the taste of gravy and add more salt or sugar if required."
            ],
            "Description": "This Mushroom tikka masala is a flavorful, rich, creamy and delicious restaurant style curry made with marinated grilled/sauteed mushrooms in a smooth, silken gravy base of onions, tomatoes and cashews. Make it for special occasions for a luxurious meal with a side of roti, naan, paratha or cumin rice.",
            "Prep Time": "",
            "Cook Time": "30 minutes",
            "Total Time": "",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Main Course"
        },
        {
            "Title": "Palak Mushroom",
            "Ingredients": "250, grams, palak, or 5 cups roughly chopped spinach, 1, green chili, – roughly chopped, 1, inch, ginger, – roughly chopped, 1 or 2, garlic cloves, – roughly chopped, 200 to 250, grams, mushrooms, or 2 cups chopped mushrooms, 1, medium onion, or ½ cup finely chopped onion, 1, medium tomato, or ½ cup finely chopped tomatoes, ½, inch, ginger, – finely chopped or 1 teaspoon finely chopped ginger, 2 to 3, garlic, – finely chopped or 1 teaspoon finely chopped garlic, ¼, teaspoon, turmeric powder, (ground turmeric), ½, teaspoon, red chili powder, ¼, teaspoon, 1, teaspoon, kasuri methi,, crushed (dry fenugreek leaves), ⅔ to ¾, cup, water, or add as required, 2, tablespoon, oil, 2 to 3, tablespoon, cream, salt as required, ½, teaspoon, cumin seeds, 1, inch, cinnamon, 2, green cardamoms, 3 to 4, cloves, 1, tej patta, (Indian bay leaf), 1, black cardamom",
            "Instructions": [
                "Rinse the palak or spinach leaves (250 grams) very well in running water using a colander or strainer. Drain all the water.",
                "Just chop the leaves roughly and keep them aside. 250 grams spinach gives about 5 cups of roughly chopped spinach. Ensure that you are using fresh and tender leaves.",
                "Boil 3 cups water in a pan or microwave or electric heater. If using an electric heater, then pour the hot water in a bowl. Add ¼ teaspoon salt to the hot water and stir.",
                "Then add the spinach leaves in the hot water. Close with a lid and let the spinach leaves sit in the water for 2 to 3 minutes.",
                "Strain the spinach leaves. Keep the stock aside as we can use later. Immediately add the strained spinach leaves in a bowl containing cold water. Water in which some ice cubes are added. Just add 8 to 10 ice cubes to 3 cups water to get cold water. Allow the spinach leaves to be in the cold water for a minute or two.",
                "Now add the spinach leaves in a blender or grinder along with green chili, ginger and garlic.",
                "In a pan or kadai or wok heat any neutral-flavored oil. Then add the whole spices –  cumin seeds, cinnamon, green cardamoms, cloves, tej patta and black cardamom. Saute for some seconds till the spices become fragrant.",
                "Then add onions. Saute stirring often till the onions start becoming golden.",
                "Then add ginger and garlic. Saute for some seconds or till their raw aroma goes away.",
                "Now add tomatoes and saute them stirring often till they soften completely and you see oil releasing from the sides of the mixture. Takes about 2 to 3 minutes on a low to medium heat.",
                "Add mushrooms. Stir and mix them well.",
                "When sauteing the mushrooms, in the beginning, you will see them releasing a lot of water.",
                "Add kasuri methi which has been crushed. Stir.",
                "Then add turmeric powder, red chili powder and garam masala powder.",
                "Stir and mix very well again so that the spices get incorporated evenly in the mushroom mixture.",
                "Now add water. You can adjust the amount of water as required. Season with salt as required.",
                "Stir and bring the curry to a simmer on a low to medium heat for 6 to 7 minutes.",
                "Now add light or low fat cream. If using heavy whipping cream then reduce the quantity to approximately half.",
                "Stir the gravy very well so that the cream is mixed evenly in it and then switch off the flame. Check the taste and add more salt or red chili powder or garam masala powder if required.",
                "Serve palak mushroom hot or warm with some roti, paratha, naan bread, tandoori rotis, steamed rice, cumin rice or veg pulao."
            ],
            "Description": "Palak Mushroom is a healthy and delicious dish of sauteed button mushrooms and aromatics in a creamy spinach sauce. Loaded with the goodness of spinach and mushrooms you are sure to like this dish. Make it for a hearty weekend lunch or dinner to mop it with some soft roti, crispy paratha or enjoy it with fragrant cumin rice.",
            "Prep Time": "20 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mushroom Tikka | Tandoori Mushroom",
            "Ingredients": "200 to 250, grams, button mushrooms, ½, tablespoon, or crushed ginger-garlic or about ½ to 1 inch ginger + 3 to 4 small to medium garlic cloves crushed in a mortar and pestle, ½, teaspoon, carom seeds, ¼ or ½, teaspoon, red chili powder, – ½ teaspoon red chili powder can make the tikka a bit hot, ¼, teaspoon, 1, pinch, turmeric powder, 3 to 4, tablespoon, gram flour, (besan), can swap with chickpea flour instead, 1, tablespoon, oil, – to be used only if grilling or baking the mushrooms in the oven, salt, or black salt or edible rock salt – as required, 2 to 3, pinches, chaat masala, –  to sprinkle, 1 to 2, tablespoons, chopped coriander leaves, – for garnish, few drops, lemon juice, or add as required and lemon wedges to be served, 1, onion, (medium-sized), sliced thinly with some salt & lemon juice added – served as an accompaniment.",
            "Instructions": [
                "Keep aside to marinate for 20 to 25 minutes.",
                "Preheat the oven to 200 degrees Celsius for 10 minutes.",
                "After 20 to 25 mins, add the gram flour and mix well.",
                "Bake or grill in the oven for 25 to 30 minutes or till the mushrooms are cooked and tender and are browned.",
                "After 15 to 20 minutes when grilling, you can turn the skewers so that there is uniform grilling.",
                "If you want you can sprinkle or spray some oil on the mushrooms after 15 to 20 minutes.",
                "Sprinkle lemon juice, chaat masala, coriander leaves on the mushroom tikka.",
                "Serve mushroom tikka hot or warm with mint chutney, roti or naan or even bread."
            ],
            "Description": "If you don’t like mushrooms knowing the fact that it is a type of fungi, let me give you a reason to change that thought process of yours. Presenting a recipe which has all the grilled goodness. This Mushroom Tikka or Tandoori Mushroom is a delectable and easy way to put ‘em mushrooms in use. You just have to marinate the mushrooms, and grill, bake or tandoor cook them. I’m guaranteeing that after trying this preparation, mushrooms are going to be your favorite!",
            "Prep Time": "30 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Side Dish, Starters"
        },
        {
            "Title": "Vegetarian Lasagna Recipe | Mushroom Spinach Lasagna",
            "Ingredients": "2, cups, spinach, – chopped or 150 grams spinach – finely chopped, 200, grams, white button mushrooms, – chopped or sliced – about 2 cups chopped or sliced mushrooms, 1, onion, – small-sized, finely chopped, 2 to 3, garlic cloves, – finely chopped or minced, ½, teaspoon, dry oregano, 4 to 5, basil leaves, chopped or 1 teaspoon dry basil, 1, pinch, ground nutmeg, or grated nutmeg, 6 to 7, tablespoon, light cream, 25% to 35% fat or low fat-cream, ½ to ⅔, cup, mozzarella cheese, – grated, can use processed cheese or cheddar or parmesan or cottage cheese or mix of various cheese, 6 to 8, tablespoons, (thick tomato puree), or preferred tomato sauce, 7, lasagna sheets, 1, tablespoon, olive oil, 1, tablespoon, salt, as required, crushed black pepper, as required",
            "Instructions": [
                "First rinse and chop the spinach leaves. Also rinse the button mushrooms and slice or chop them.",
                "You will need 2 cups of chopped spinach leaves and 2 cups chopped mushrooms.",
                "Then heat 1 tablespoon butter and 1 tablespoon olive oil in a saucepan or frying pan.",
                "Add finely chopped onions and finely chopped garlic. On medium-low to medium heat, stir and sauté for about 2 to 3 minutes or till the onions turn translucent.",
                "Add the chopped mushrooms. Stir and mix again. Sauté mushrooms on a medium-low to medium heat.",
                "Add fresh cream, chopped basil leaves, dry oregano, a pinch of nutmeg powder, freshly crushed black pepper and salt as required.",
                "At this point, you can use herbs and seasonings of your choice. You can also use dried basil instead of fresh basil.",
                "Mix very well and switch off the heat. Keep the creamy mushroom spinach stuffing aside.",
                "Now boil enough water in a pan or pot.",
                "When the water comes to a vigorous boil, add the lasagna sheets and cook them till they are al dente – meaning cooked but still they have a bite to them. This will take about 7 to 8 minutes on high heat.",
                "Drain all of the water and place them separately without touching each other on a tray. You can spread some olive oil on them.",
                "Before assembling, preheat oven at 180 degrees Celsius/350 degrees Fahrenheit for 10 minutes.",
                "In a baking pan or casserole, spread 1 to 2 tablespoons of tomato puree. You can also use your preferred tomato sauce or tomato ketchup.",
                "If using tomato ketchup the lasagna will have a sweet taste, which goes well with kids.",
                "To make the tomato puree, blanch one medium to large tomato in hot water for 10 to 15 minutes. Peel and then puree it in a blender or mixer.",
                "Now spread one lasagna sheet. Depending on the type and size of the pan, you will have to slice or cut the sheets to accommodate them in the pan.",
                "Spread ¼ portion of the mushroom spinach sauce filling evenly.",
                "Sprinkle with 2 to 3 tablespoons of grated or shredded mozzarella cheese or as needed.",
                "Place another sheet of lasagna. Spread 1 to 2 tablespoons of tomato puree/sauce/ketchup on it",
                "Then top with ¼ portion of the spinach mushroom filling. Then add 1 to 2 to 3 tablespoons of the grated cheese or as required.",
                "Bake spinach mushroom lasagna in a preheated oven for 180 degrees C/356 degrees F for 15 to 20 minutes or till the cheese melts or gets golden.",
                "Allow to rest for 15 to 20 minutes and then serve Vegetarian Lasagna hot or warm."
            ],
            "Description": "With multiple layers of perfectly al dente pasta, a creamy, veggie-filled stuffing, loads of melty cheese, and a bright tomato sauce, this Vegetarian Lasagna or Mushroom Spinach Lasagna is a vegetarian food-lover’s dream. Best of all, this recipe takes just 30 minutes of active prep time before popping in the oven, meaning it’s simple enough for even weeknight cooking!",
            "Prep Time": "30 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Italian, World",
            "Course": "Main Course, Snacks"
        },
        {
            "Title": "Penne Pasta Recipe (In Tomato Mushroom Sauce)",
            "Ingredients": "200 to 250, grams, penne pasta, 4 to 5, cups, water, or add as required, salt, as required, 6 to 7, tomatoes, – medium-sized, chopped or 3 to 3.5 cups chopped tomatoes, 2, onions, – medium-sized, thinly sliced or finely chopped or 1 cup, sliced, 300, grams, button mushrooms, – chopped or sliced, 6 to 7, garlic cloves, small to medium sized, crushed or minced or 1.5 to 2 teaspoons, crushed, 1, teaspoon, ground black pepper, 2, teaspoons, Italian seasoning, or your preferred dried herbs, 1, teaspoon, dried oregano, 4, green olives, – pitted, 4, black olives, – pitted, 3, tablespoons, extra virgin olive oil, salt, as required",
            "Instructions": [
                "Boil the water together with salt in a pan or pot on high heat.",
                "When the water begins boiling, add the penne and cook until al dente. The timing will vary with the quality of pasta.",
                "Add the sliced onions and sauté them stirring often till they become light golden on low to medium-low heat.",
                "Add the crushed garlic and sauté for about 15 to 20 seconds.",
                "Add the chopped tomatoes, herbs, salt and pepper. Stir to combine well.",
                "Sauté the tomatoes until they soften, become pulpy and mushy. This will take about 15 to 20 minutes on a low to medium-low heat.",
                "Keep on stirring in after couple of minutes when the tomatoes are getting cooked.",
                "Now add the chopped button mushrooms.",
                "The mushrooms will loose water and then shrunk in size and then get finally cooked. This process will take about 10 to 12 minutes on low to medium-low heat.",
                "The sauce will thicken and appear less runny or watery after the mushrooms have cooked thoroughly and become tender.",
                "Finally add the olives and sauté for 2 to 3 minutes on low heat.",
                "Serve the cooked penne with the tomato mushroom sauce or you can choose to mix the penne pasta with the sauce and serve.",
                "While serving, garnish with your choice of fresh herbs or some cheese if you like."
            ],
            "Description": "This Penne Pasta recipe is my way of making a delicious and comforting saucy pasta dish featuring tangy tomatoes, sweet onions, earthy mushrooms, salty olives and fragrant herbs. The recipe is suitable for both vegans and vegetarians. Make it for a weeknight dinner as a hearty and tasty pasta meal.",
            "Prep Time": "15 minutes",
            "Cook Time": "50 minutes",
            "Total Time": "65 minutes",
            "Cuisine": "Vegan",
            "Course": "Main Course"
        },
        {
            "Title": "Garlic Butter Mushrooms | Garlic Mushrooms",
            "Ingredients": "250, grams, white button mushrooms, 10, grams, garlic cloves, or 1 tablespoon finely chopped garlic, 2, tablespoons, – salted or unsalted, 1, teaspoon, dried oregano, or dried basil or dried herbs – can also add 2 teaspoons of fresh parsley or coriander leaves or fresh basil, ½, teaspoon, black peppercorns, – crushed or ¾ to 1 teaspoon crushed black pepper – add as required, salt, as required",
            "Instructions": [
                "On a low heat, add 2 tablespoons butter in a pan. Keep the heat to low, so that the butter does not get burnt.",
                "Add the finely chopped garlic and sauté for about half a minute on low heat, till their raw aroma of garlic goes away.",
                "Now add the button mushrooms. Stir and saute them on a low to medium heat. Initially the mushrooms will leave lot of water.",
                "You can continue to sauté until the mushrooms turn a light golden or golden at the edges.",
                "Once all of the water has evaporated and the mixture looks dry, add the dried herbs, crushed black pepper and salt.",
                "Mix well. Switch off the heat.",
                "Serve Garlic Butter Mushroom as is or accompanied with bread or any flat bread."
            ],
            "Description": "I really feel that edible variety of mushrooms are an excellent ingredient to work with. These are nutritious, get cooked within minutes and are super tasty. So, even if you are hesitant with the thought of mushrooms, I’ll say try this gluten free recipe of Garlic Butter Mushrooms that I’ve shared here. Button mushrooms, butter, garlic and herbs is all you need to make these quick dish, packed with flavors. This 15 minute Garlic Mushrooms recipe will surely develop your liking towards mushrooms.",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "American, World",
            "Course": "Side Dish"
        },
        {
            "Title": "Chinese Mushroom In Spicy Sauce",
            "Ingredients": "200, grams, white button mushrooms, – chopped, 2, tablespoons, sesame oil, – regular or toasted, 2, teaspoons, garlic, – finely chopped, 1 to 1.5, teaspoons, ginger, – finely chopped, 3, tablespoons, spring onion whites, – chopped (scallions) or 3 tbsp finely chopped onions, 1 to 2, teaspoons, celery, – finely chopped, optional, 1, tablespoon, soy sauce, – naturally brewed, add as required, 2, teaspoons, red chili sauce, or red chili paste or add as required, can also add sriracha sauce, ¼, teaspoon, black peppercorns, or ½ teaspoon crushed black pepper or ground pepper, 2, sichuan peppers, – crushed lightly in a mortar-pestle, optional, ⅔ to ¾, cup, – water, 1, tablespoon, cornstarch, + 2 tablespoons water, ½, teaspoon, rice vinegar, or regular vinegar, 1, teaspoon, rice wine, – optional, ¼ to ½, teaspoon, sugar, 2 to 3, tablespoon, spring onion greens, – chopped, (scallion greens), salt, as required",
            "Instructions": [
                "Rinse or wipe dry the mushrooms. Chop them and keep aside.",
                "Dissolve 1 tablespoon cornstarch with 2 tablespoon water to a fine, smooth paste or slurry. Keep aside.",
                "Heat sesame oil in a frying pan or wok. Add finely chopped garlic and finely chopped ginger. Sauté on a medium heat for half a minute.",
                "Then add chopped spring onion whites or finely chopped onions. Sauté for a minute on medium heat.",
                "Next finely chopped celery. Celery is optional and you can skip it.",
                "Now add crushed black pepper or pepper powder and the crushed sichuan pepper. Stir and mix well with the rest of the mixture.",
                "Next add sliced or chopped white button mushrooms.",
                "Sauté the mushrooms on a medium heat.",
                "Then add the naturally brewed soy sauce. For a gluten-free version, use gluten-free soy sauce.",
                "Next add red chilli sauce or red chili paste. Red chilli paste would make the sauce more spicy. You can add both the soy sauce and chilli sauce as per your taste. Mix very well.",
                "Pour ⅔ to ¾ cup of vegetable stock or water.",
                "Add ¼ to ½ teaspoon sugar. Stir and mix well.",
                "Then add the cornstarch paste or slurry.",
                "Stir and mix very well after you add the cornstarch paste.",
                "Bring the sauce to a simmer on medium heat. Then add salt. Add less salt as soy sauce and chilli sauce already has salt in them.",
                "Mix very well and continue to simmer for some minutes till the sauce thickens.",
                "Switch off the heat and lastly add 2 to 3 tablespoons of the spring onion greens, ½ teaspoon rice vinegar and 1 teaspoon rice wine (optional).",
                "Give a quick stir and serve this spicy Chinese Mushrooms with fried rice, stir fried noodles, hakka noodles or chowmein. It also pairs well with steamed rice."
            ],
            "Description": "Here’s a simple dish that you can make for the main course, whenever you are having a Chinese special party at home. Chinese Mushroom In A Spicy Sauce base is vegan and loaded with umaminess. It uses all the basic ingredients that usually go in Chinese cooking and you can stir it up in no time. Whenever you don’t want to have mushrooms, you can use any other vegetables or even tofu in this recipe.",
            "Prep Time": "10 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Chinese, World",
            "Course": "Main Course"
        },
        {
            "Title": "Sautéed Mushrooms Recipe",
            "Ingredients": "3, tablespoons, extra virgin olive oil, 1, teaspoon, finely chopped garlic, or or minced garlic – 3 to 4 medium sized garlic cloves, 500, grams, button mushrooms, ½, teaspoon, crushed black pepper, or ground pepper, ½, teaspoon, paprika, or cayenne pepper, 1, tablespoon, red wine, or dry white wine or sherry, salt, as required, 1 to 3, tablespoons, finely chopped parsley, or herbs of choice, chopped parsley, (few) or herbs of choice",
            "Instructions": [
                "Clean the white button mushrooms by quickly rinsing them or, preferably, wiping them with a moist kitchen cotton napkin or paper towel.  Slice them and set aside.",
                "Heat extra virgin olive oil over low heat in a skillet or frying pan. Add the finely chopped garlic and sauté until fragrant, for a few seconds. Do not brown garlic, as this may result in a bitter flavor.",
                "Add the sliced mushrooms and mix them with the oil and garlic.",
                "Add freshly crushed black pepper, paprika and salt as required. Add red or white wine. Mix very well.",
                "On medium heat, begin to sauté the mushrooms stirring often. Initially you will see the mushrooms releasing lot of water.",
                "Gradually the water will reduce. Continue to sauté until all water dries up and the mushrooms look glossy. When the water dries up, reduce heat to a low.",
                "Do not rush the sautéing process. You want the mushrooms to be fully cooked, or you might risk some indigestion.",
                "Add 1 to 3 tablespoons finely chopped parsley to taste. Mix and sauté for a minute. Taste and adjust the seasonings as necessary.",
                "Serve garnished with additional parsley or top with grated cheese of choice.",
                ": For a lovely, light brunch, lunch or dinner fry a piece of your favorite bread in olive oil or butter. Top with sautéed mushrooms and any number of other toppings like cheese, sautéed onions, or fresh herbs. Serve with a side salad for a complete meal.",
                ": Include these meaty sauteed mushrooms as a topping in your sandwiches or veggie burger or add to your wraps, sliders or quesadilla.",
                ": Serve with dal (lentils) or Khichdi for an Indian inspired meal, or rice, pasta or mashed potatoes for a quasi-stroganoff feeling meal.",
                ": Use as a filling in a vegan omelette or add to your favorite quiche or your breakfast scramble.",
                ": Add to your favorite veggie or tofu stir fry and serve over rice or noodles.",
                "Store any leftovers in the refrigerator for 2 to 3 days. While reheating, sauté them in a skillet or pan until warm."
            ],
            "Description": "These delicious and quick Sautéed Mushrooms are a perfect recipe for just about any occasion. In less than 30 minutes and using just a few ingredients, you will have a hearty and versatile dish that will help you make a beautiful breakfast, lunch or dinner.",
            "Prep Time": "10 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "American, World",
            "Course": "Appetizer, Breakfast, Brunch, Main Course, Side Dish, Snack"
        },
        {
            "Title": "Mushroom Sandwich Recipe",
            "Ingredients": "2, tablespoons, olive oil, or butter, 250, grams, chopped button mushrooms, or 3 cups chopped mushrooms, ⅓, cup, chopped spring onions with greens, or ⅓ cup chopped onions, ½, teaspoon, chopped garlic, or 2 to 3 garlic cloves, chopped, ½, teaspoon, oregano, ½, teaspoon, crushed black pepper, 1, tablespoon, chopped parsley, or coriander leaves or mint leaves, salt, as required, 6 to 8, slices, bread, – whole wheat, white, brown, oats or multi grain bread",
            "Instructions": [
                "Firstly, rinse or wipe the mushrooms and then chop them. Then, heat olive oil in a pan. You can also use butter instead of olive oil.",
                "Add chopped garlic. Sauté till the raw aroma of garlic goes away. There is no need to brown the garlic.",
                "Then, add chopped spring onions with the greens. Sauté for a minute on low to medium heat.",
                "You can also add ⅓ cup chopped onions instead of spring onions. If adding onions, then sauté till they are translucent.",
                "Now, add the chopped mushrooms.",
                "Stir and sauté on low to medium heat.",
                "Continue to sauté till all the water evaporates.",
                "Once all the water has evaporated, add dried oregano, crushed black pepper and chopped parsley or coriander leaves.",
                "Also, add salt as per taste. You can add any dried herb or fresh herbs of your choice.",
                "Mix well. Switch off the heat.",
                "Take the bread slices. Slice the edges if you want. You can use your preferred bread to make the sandwiches.",
                "Spread the prepared mushroom filling on the bread slices.",
                "Place the sandwiches in a preheated toaster or grill. You can also toast these sandwiches in a hand held stove top toaster.",
                "Grill the sandwiches till crisp and golden.",
                "Slice the grilled sandwiches.",
                "Serve Mushroom Sandwich hot with green chutney or tomato ketchup."
            ],
            "Description": "Got mushrooms and bread in hand? The best way to put them together is to refer to this really easy grilled Mushroom Sandwich recipe and make it for your near and dear ones. This is a vegan-friendly Mushroom Sandwich and gets done within few minutes. Best example of a snack which is simple and scrumptious.",
            "Prep Time": "15 minutes",
            "Cook Time": "10 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "American, World",
            "Course": "Snacks"
        },
        {
            "Title": "Mushroom Paneer",
            "Ingredients": "2, tablespoons, oil, 1, cup, chopped onion, or 1 large onion or 115 grams onion, ¾, cup, chopped tomatoes, or 1 large tomato or 115 grams tomatoes, 1, teaspoon, chopped garlic, 1, teaspoon, chopped ginger, 2, tablespoons, cashews, 3 to 4, tablespoons, water, for grinding, 1, tablespoon, oil, 1, small to medium tej patta, (indian bay leaf), ½, teaspoon, shahjeera, (caraway seeds), 200, grams, white button mushrooms, ¼, teaspoon, kashmiri red chilli powder, ¼, teaspoon, black pepper powder, 1, cup, water, salt, as required, ¼, teaspoon, ¼, teaspoon, kasuri methi, – crushed (dry fenugreek leaves), 200, grams, (cottage cheese)",
            "Instructions": [
                "Rinse or wipe dry the button mushrooms. Slice off a bit of the base stalk. Then slice or chop mushrooms. Keep aside.",
                "Peel, rinse and chop onion, garlic and ginger. Also chop tomato. Keep aside.",
                "Heat 2 tablespoons oil in a pan or kadai. add the chopped onion.",
                "Mix and then saute on a low to medium flame till the onion starts turning golden.",
                "Then add the chopped ginger, garlic and saute till the raw aroma of both ginger and garlic goes away.",
                "Next add the chopped tomatoes and 2 tablespoons whole cashews.",
                "Mix very well and begin to saute the tomatoes on a low heat.",
                "If the tomatoes start sticking to the pan, then you can sprinkle some water. Stir and continue to saute.",
                "Saute till the tomatoes soften very well. Switch off heat and let this onion-tomato mixture become warm or cool down at room temperature.",
                "Then take this mixture in a grinder or blender jar.",
                "Add 3 to 4 tablespoons water and grind or blend to a smooth fine paste. There should not be any chunks of cashews or tomatoes in the paste. Keep aside.",
                "Now heat 1 tablespoon oil in the same pan. Add 1 small to medium tej patta and ½ teaspoon shahi jeera (caraway seeds).",
                "Fry till the shahi jeera splutters on low heat. If you do not have shahi jeera, then you can use jeera (cumin seeds) or else skip shahi jeera.",
                "Now add the chopped mushrooms. Stir and mix them well.",
                "Begin to saute them on a low heat stirring often.",
                "The mushrooms will release water when cooking.",
                "Continue to saute stirring often till all the water dries up. The entire mixture should be dry before you proceed to the next step.",
                "Now add ¼ teaspoon kashmiri red chilli powder and ¼ teaspoon black pepper powder. mix very well.",
                "Now add the ground onion-tomato-cashew paste and mix very well.",
                "Saute stirring non-stop for 4 to 5 minutes. Then add 1 cup water and mix again very well.",
                "Season with salt as per taste and mix again. On a low heat let the gravy come to a boil.",
                "Then add ¼ teaspoon garam masala powder and ¼ teaspoon kasuri methi (crushed). mix again well.",
                "Now add 200 grams paneer chopped in cubes or squares.",
                "Then add ¼ cup grated or crumbled paneer. You can use 3 to 4 cubes from the 200 grams paneer and crumble them and add.",
                "Mix very well and simmer for a few seconds.",
                "Switch off heat and add 1 tablespoon chopped coriander leaves.",
                "Mix well and serve mushroom paneer with tandoori roti, phulka, naan, butter naan, pudina paratha, kerala parotta and even pooris.",
                "This gravy also goes well with a mildly spiced rice like cumin rice, garam masala rice, matar pulao, ghee rice, kuska rice, saffron rice."
            ],
            "Description": "Mushroom paneer with step by step pics. This is a restaurant style recipe with a super delicious taste. The gravy or curry is creamy, slightly tangy and a bit sweet with tender mushrooms and soft paneer in it. Serve it with roti, naan, paratha, jeera rice or steamed basmati rice for a rich and tasty meal.",
            "Prep Time": "25 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Main Course"
        },
        {
            "Title": "Ambur Biryani (with mushrooms)",
            "Ingredients": "1, cup, heaped seeraga samba rice, or 210 grams seeraga samba rice, 3.5, cups, water for cooking rice, 1, small tej patta, (Indian bay leaf), 1, green cardamom, 1, clove, ½, inch, cinnamon, ¼ to ½, teaspoon, salt, or add as required, 4 to 5, dry red chilies,, use byadagi or kashmiri or a mix of both, ⅓, cup, hot water for soaking, 3, tablespoons, oil, 1, small to medium tej patta, (Indian bay leaf), 2, green cardamoms, 2, cloves, ½, inch, cinnamon, 1, cup, thinly sliced onions, 1, teaspoon, 1, cup, chopped tomatoes, 1, tablespoon, chopped mint leaves, 2, tablespoons, chopped coriander leaves, ¼, teaspoon, turmeric powder, – optional, ½, teaspoon, optional, ¼, cup, (yogurt), 200, grams, white button mushrooms,, sliced or 2 cups sliced mushrooms, ½, cup, water, salt as required",
            "Instructions": [
                "Firstly rinse and then soak 4 to 5 dry red chilies in hot water for 20 to 30 minutes. Cover and keep aside. If you prefer you can remove the seeds before soaking them.",
                "Grind or blend to a smooth paste. Keep the red chili paste aside.",
                "When you keep the red chilies for soaking, then also rinse 1 heaped cup seeraga samba rice in water first. Then soak in enough water for 20 to 30 minutes. Meanwhile, when the red chilies and rice are soaking, prep the other ingredients like cleaning and chopping mushrooms, onions and tomatoes etc.",
                "After 20 to 30 minutes, drain the water from the rice and keep aside.",
                "Also bring 3.5 cups of water to a boil in a pan. When the water comes to a boil, add tej patta, green cardamom, clove, cinnamon and salt.",
                "Bring the water to a rolling boil and add the soaked rice.",
                "Do not reduce the heat and let the rice cook on medium to high heat. Cook the rice without covering the pan with any lid.",
                "Once the rice is ¾th cooked, then switch off the heat. The rice has to have some bite in the center when you eat it.",
                "In another pan heat 3 tablespoons oil. Keep the heat to a low and then add tej patta, green cardamoms, cloves and cinnamon.",
                "When the spices splutter and become fragrant, then add thinly sliced onions.",
                "Saute the onions on medium heat. Stir often while sauteing them for even cooking.",
                "When the onions start becoming golden, then add ginger-garlic paste.",
                "Stir and saute for a few seconds or till the raw aroma of ginger and garlic goes away.",
                "Next add chopped tomatoes and saute them for a minute.",
                "Then add chopped mint leaves and chopped coriander leaves. Mix well.",
                "Keep the heat to a low or sim. Then add fresh curd. Quickly stir the curd while you add it.",
                "Next add turmeric powder and coriander powder. If you want then you can skip adding turmeric powder and coriander powder.",
                "Add ½ cup water. Stir and mix well.",
                "Season with salt as per taste. Mix again. Check the taste of the liquid and it should taste slightly salty.",
                "Cover the pan with its lid and simmer the gravy on a medium heat till the mushrooms are cooked. This takes about 7 to 8 minutes on a low to medium heat.",
                "Seal the pan with an aluminium foil. Also heat a tawa on a low heat for 5 minutes.",
                "Place the lid on the pan. Then keep the pan on the hot tawa or skillet and dum cook on a low heat for 30 to 35 minutes.",
                "If baking – then bake the ambur biryani at 180 degrees celsius in a preheated oven for 30 to 35 minutes. Please remember to use an oven proof glass utensil like the pyrex bowl for baking in the oven. You will have to assemble the biryani as mentioned above in the oven proof utensil. Cover with aluminium foil and then bake.",
                "Give a resting time of 5 to 7 minutes and then serve the ambur star biryani. There should be no gravy or liquid at the bottom of the pan. If you see some gravy in the biryani, then continue to dum cook for some more minutes.",
                "Serve Ambur star biryani hot or warm with onion-tomato raita or onion raita or plain yogurt."
            ],
            "Description": "This Ambur Biryani is a vegetarian version of the famous biryani from Ambur and made with white button mushrooms, onions, tomatoes, curd, herbs and spices. Ambur is a town in the Vellore district of Tamil Nadu and its biryani is very famous and usually made with meat. Make this vegetarian Ambur Biryani for a hearty weekend lunch or dinner with a side of yogurt, raita or vegetable salad.",
            "Prep Time": "30 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "South Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Quesadilla Recipe | Mushroom and Veggie Quesadilla",
            "Ingredients": "2, tablespoons, extra virgin olive oil, or sunflower oil, avocado oil, ½, cup, onions, (sliced) or 1 medium-sized onion, ½, teaspoon, garlic, (finely chopped) or 2 to 3 small to medium garlic cloves, 2 to 2.5, cups, button mushrooms, (sliced) – 250 grams, salt, as required, ½, teaspoon, ground cumin, or cumin powder, ½, teaspoon, sweet paprika, ½, teaspoon, cayenne pepper, or red chilli powder, ¼, teaspoon, crushed black pepper, ½, teaspoon, dried oregano, or add as required, ½, cup, red bell pepper, (thinly sliced) or mix of green bell pepper and red bell pepper, ½, teaspoon, lemon juice, – optional, 1, tablespoon, chopped cilantro, (coriander leaves) or parsley, 4, tortilla, – medium sized, ½, cup, cheddar cheese, (shredded) or Monterey Jack cheese, 3 to 4, tablespoons, oil, or add as needed, any neutral oil, 1, bowl, 1, bowl, 1, bowl, Sour Cream",
            "Instructions": [
                "First prep and chop all the veggies – onions, red bell pepper and mushrooms. Also chop the herbs – garlic and cilantro and set aside.",
                "Set 4 large tortilla or 6 small tortilla aside.",
                "Grate the cheddar cheese and set aside as you want to work quickly so the tortilla doesn't burn while you assemble the quesadilla.",
                "Heat 2 tablespoons extra virgin olive oil in a pan. Reduce heat. Add the sliced onions and finely chopped garlic.",
                "Sauté onions and garlic till onions become light golden.",
                "Add the sliced or chopped button mushrooms and salt as needed.",
                "Increase the heat a bit and sauté mushrooms, stirring often. Initially, the mushrooms will leech out plenty of water.",
                "Continue to sauté until all the water dries up in the pan.",
                "Add all the ground spices, oregano and mix well.",
                "Next add thinly sliced red capsicum. Mix and sauté on a medium-low heat for a few minutes until the veggies are half cooked. They should have some crunch and not soften completely.",
                "Switch off heat. Add lemon juice (optional). Also add chopped cilantro (coriander leaves) or parsley. Mix and set the veggie filling aside.",
                "Heat a heavy skillet or frying pan. Keep the heat to medium or medium-low.",
                "Place a tortilla on a heavy griddle or pan for 10 to 15 seconds. Turn over with a spatula.",
                "Drizzle some oil at the sides. Move the tortilla with a spatula so that the oil is spread through.",
                "As soon as you turn over the tortilla, begin to arrange your fillings.",
                "First add 2 to 3 tablespoons shredded cheddar or Monterey jack cheese on one side of the tortilla. Top with with 4 to 5 tablespoon of the prepared sautéed mushroom and bell pepper filling.",
                "Top again with 2 to 3 tablespoons of shredded cheddar or monterey jack cheese. You can switch off the heat if the pan gets too hot or the tortilla begins to burn.",
                "Fold the tortilla. Drizzle ½ to 1 tablespoon oil on the sides. With a spatula move it around the pan so that the oil spreads evenly on the tortilla.",
                "Press lightly from top and pan roast till the base is crisp with golden spots. Turn over gently and roast the second side. You can drizzle some oil at the sides if you want.",
                "Prepare the remaining Veggie Quesadilla in batches this way.",
                "Alternatively, after roasting the tortilla, you first place it on a board or plate. Fill it, fold it and place it carefully on the skillet.",
                "Spread 2 to 3 teaspoons oil before keeping the folded stuffed tortilla on the skillet or frying pan. Pan fry both sides until crisp and golden.",
                "Remove from Quesadilla from pan and cut into wedges if you prefer. Serve with your choice of fillings – guacamole, sour cream, salsa and hot sauce all make a lot of sense here."
            ],
            "Description": "Melty cheese and sautéed veggies team up in this delightful vegetarian Quesadilla Recipe. This traditional Mexican meal is easy to make, highly adaptable to any veggies you have on hand, and is a hit with kids and adults alike. My Veggie Quesadilla recipe is simple but high on flavors and takes under 40 minutes if you have your tortillas ready.",
            "Prep Time": "10 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Mexican, World",
            "Course": "Brunch, Main Course, Snack"
        }
    ],
    "recipe_count": 32
}